[
  {
    "id": 1,
    "text": "Once the make‑or‑buy analysis is completed, which document defines the project delivery method?",
    "options": [
      "Procurement statement of work (SOW)",
      "Procurement strategy",
      "Terms of reference",
      "Change request"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 2,
    "text": "A project is just beginning, and management creates a long list of potential stakeholders. Which statement about identifying and engaging stakeholder is correct?",
    "options": [
      "The project manager should identify and deal with stakeholders only during the execution phase.",
      "Stakeholder satisfaction should be identified immediately and managed as a project objective.",
      "The project manager should focus on project objectives and deal with stakeholders as a secondary priority.",
      "Stakeholder satisfaction is the most important goal, and project objectives should be considered a secondary priority."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 3,
    "text": "Which is an example of leveraging evolving trends and emerging practices in Project Integration Management?",
    "options": [
      "Hybrid methodologies",
      "Risk register updates",
      "Outsourced project resources",
      "Reliance on lessons learned documents"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 4,
    "text": "What should a project manager use to determine how much money is needed to complete a project?",
    "options": [
      "Earned value management (EVM)",
      "Estimate at completion (EAC)",
      "Earned value analysis (EVA)",
      "Budget at completion (BAC)"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 5,
    "text": "The project manager is creating the communications management plan. Which group of inputs is required to begin?",
    "options": [
      "Work performance reports, change requests, and risk register",
      "Work performance data, project documents, and stakeholder engagement plan",
      "Project charter, project management plan, and project documents",
      "Work performance data, stakeholder register, and team management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 6,
    "text": "A project is in progress and about to move to a different phase, according to the plan. This will be a good opportunity for the project manager to:",
    "options": [
      "create the project management plan.",
      "identify the project objectives.",
      "review and update stakeholder engagement.",
      "create the schedule baseline."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 7,
    "text": "A new project has been set. Four main stakeholders besides the project manager and four other team members have been identified. How many communication channels are available?",
    "options": [
      "8",
      "18",
      "36",
      "40"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 8,
    "text": "A project manager is preparing to meet with three crucial project stakeholders on a new project. Which tools and techniques can the project manager use to capture stakeholder interest?",
    "options": [
      "Review stakeholder register and meeting",
      "Data analysis and communication skills",
      "Data gathering and data analysis",
      "Communication skills and cultural awareness"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 9,
    "text": "What are the project management processes associated with project quality management?",
    "options": [
      "Plan Quality Management, Manage Quality, and Control Quality",
      "Plan Quality Management, Manage Quality, and Cost of Quality",
      "Manage Quality, Customer Satisfaction, and Control Quality",
      "Customer Satisfaction, Control Quality, and Continuous Improvement"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 10,
    "text": "In an adaptive project environment, which action helps the project manager ensure that the team is comfortable with charges?",
    "options": [
      "Having control over the planning and delivery of the products without delegating decisions",
      "Giving access to information to the team and frequent team checkpoints",
      "Selecting different team members to take the project manager role during reviews with stakeholders",
      "Asking the control change board to approve changes before notifying the team"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 11,
    "text": "The activity of tailoring is necessary because:",
    "options": [
      "the members of the project team need to select the appropriate order of every tool, technique, input, and output listed in the PMBOK Guide; this is required for all projects.",
      "each project is unique, and the members of the project team should select the appropriate tools, techniques, inputs, and outputs from the PMBOK Guide.",
      "the members of the project team need to understand the PMBOK Guide processes, which are applied to all projects.",
      "each project is unique, and the project team must plan how to apply all the tools, techniques, inputs, and outputs in the PMBOK Guide."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 12,
    "text": "When developing the project schedule, a project manager uses decomposition and rolling wave planning techniques in this process:",
    "options": [
      "Develop Schedule",
      "Define Activities",
      "Define Scope",
      "Collect Requirements"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 13,
    "text": "Which of the following tasks focuses on decomposing work packages?",
    "options": [
      "Adjust duration estimates",
      "Define activities",
      "Complete rolling wave planning",
      "Develop milestone list"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 14,
    "text": "During what project management process does the project manager invest the most effort into creating the work breakdown structure (WBS)?",
    "options": [
      "Initiating",
      "Planning",
      "Executing",
      "Monitoring and Controlling"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 15,
    "text": "Given the following information: Activity A takes one week; Activity B takes three weeks; Activity C takes two weeks; Activity D takes five weeks; Activity A starts at the same time as Activity B; Activity C follows Activity B and Activity A; Activity D follows Activity C. How long will it take to complete the project?",
    "options": [
      "8 weeks",
      "9 weeks",
      "10 weeks",
      "11 weeks"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 16,
    "text": "Which is an example of analogous estimating?",
    "options": [
      "Estimates are created by individuals or groups with specialized knowledge.",
      "Estimates are created by using information about resources of previous similar projects.",
      "Estimates are created by analyzing data.",
      "Estimates are created at the task level and aggregated upwards."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 17,
    "text": "With regard to a project manager's sphere of influence in a project, which of the following does the project manager influence most directly?",
    "options": [
      "Suppliers",
      "Customers",
      "Governing bodies",
      "Project team"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 18,
    "text": "Which document can help a project manager to leverage historical project information?",
    "options": [
      "Lessons learned register",
      "Schedule baseline",
      "Work performance data",
      "Deliverable acceptance forms"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 19,
    "text": "Which kind of communication should the project manager use when creating reports for government bodies?",
    "options": [
      "Hierarchical",
      "External",
      "Formal",
      "Official"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 20,
    "text": "Which is the main benefit of managing and tailoring strategies in the Stakeholder Engagement process?",
    "options": [
      "Increased support and minimized resistance from stakeholders",
      "Increased performance of the project team",
      "Maintenance of stakeholder satisfaction because costs and scope are under control",
      "Updated project documents, as requested by stakeholders"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 21,
    "text": "How can a project manager evaluate project team development?",
    "options": [
      "Produce team performance assessments",
      "Hold weekly meetings to engage every member",
      "Complete a personal skill assessment on each team member",
      "Provide recognition awards to team members"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 22,
    "text": "The project manager is dividing the project scope into smaller pieces, repeating the process until no more subdivisions are required and costs and activities can be estimated for each element. What are these elements called?",
    "options": [
      "Project activities",
      "Work packages",
      "Planning packages",
      "Project deliverables"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 23,
    "text": "Which tools and techniques will a project manager use to develop a project charter?",
    "options": [
      "Project manager experience, expert judgment, scope statement, and meetings",
      "Lessons learned database, interpersonal and team skills, cost baseline, and meetings",
      "Expert judgment, data gathering, scope statement, schedule baseline, and meetings",
      "Expert judgment, data gathering, interpersonal and team skills, and meetings"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 24,
    "text": "Which key benefit can a project manager obtain by identifying stakeholders?",
    "options": [
      "Identify the appropriate focus for engagement of each stakeholder",
      "Assess the risk exposure for each stakeholder",
      "Map stakeholder power and influence grid",
      "Identify the appropriate channels of communication with all stakeholders"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 25,
    "text": "The project team is inspecting the completed project scope to determine if the requirements have been satisfied. What is the result of this inspection?",
    "options": [
      "Accepted deliverables",
      "Planning packages",
      "Verified deliverables",
      "Work packages"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 26,
    "text": "Which are the most important competencies required for a project manager?",
    "options": [
      "Leadership, bilingualism, experience, and technical knowledge",
      "PMP certification, experience, technical knowledge, and post‑graduate education",
      "Leadership, strategic and business management, project management knowledge, and technical knowledge",
      "Communication skills, project management knowledge, PMP certification, and availability to travel"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 27,
    "text": "Which is the correct hierarchy in a project environment, from most to least inclusive?",
    "options": [
      "Projects, portfolios, then programs",
      "Portfolios, programs, then projects",
      "Portfolios, projects, then programs",
      "Projects, programs, then portfolios"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 28,
    "text": "Two team members are in conflict. The project manager decides the best solution is to bring some degree of satisfaction to all parties to temporarily or partially resolve the problem. Which technique should the project manager use?",
    "options": [
      "Withdraw/Avoid",
      "Smooth/Accommodate",
      "Compromise/Reconcile",
      "Collaborate/Problem Solve"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 29,
    "text": "Which process determines the correctness of deliverables?",
    "options": [
      "Verify Deliverables",
      "Validate Deliverables",
      "Review Deliverables",
      "Analyze Deliverables"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 30,
    "text": "Why is tailoring required in a project?",
    "options": [
      "Because a one‑size‑fits‑all approach avoids complications and saves time",
      "Because every project is unique and not every tool, technique, input, or output identified in the PMBOK Guide is required",
      "Because tailoring allows us to identify the techniques, procedures, and system practices used by those in the project",
      "Project managers should apply every process in the PMBOK Guide to the project, so tailoring is not required"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 31,
    "text": "Company A has just been notified about a new legal requirement for its business operations. What is the classification of this item?",
    "options": [
      "Internal enterprise environmental factor",
      "Risk register database",
      "External enterprise environmental factor",
      "Organizational process asset"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 32,
    "text": "Which of the following documents are created as part of Project Integration Management?",
    "options": [
      "Project charter and project management plan",
      "Communications management plan and scope management plan",
      "Quality management plan and risk management plan",
      "Project scope statement and communications management plan"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 33,
    "text": "A project manager is working on an estimate. The team is estimating each work package and then summing all work packages. Which technique is being used?",
    "options": [
      "Three‑point estimating",
      "Parametric estimating",
      "Bottom‑up estimating",
      "Data analysis"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 34,
    "text": "A project manager updating their résumé realizes they need to improve expertise in the industry and organizational knowledge. Which dimension of PMI’s Talent Triangle best relates to this need?",
    "options": [
      "Strategic and business management skills",
      "Leadership skills",
      "Technical project management",
      "Organizational management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 35,
    "text": "Which project documents can determine the budget?",
    "options": [
      "Procurement documents, contracts, requirements documentation, and basis of estimates",
      "Basis of estimates, cost estimates, project schedule, and risk register",
      "Business case, project charter, statement of work, and cost estimates",
      "Scope baseline, resource management plan, activity list, and assumption log"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 36,
    "text": "When managing costs in an agile environment, what should a project manager consider?",
    "options": [
      "Lightweight estimation methods can be used as changes arise",
      "Agile environments make cost aggregation more difficult",
      "Agile environments make projects more costly and uncertain",
      "Detailed cost calculations benefit from frequent changes"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 37,
    "text": "Which statement describes the Monitor Communications process?",
    "options": [
      "Evaluates the differences between the communications management plan and actual communications",
      "Ensures that the information needs of the project and the stakeholders are met",
      "Ensures that project information is created, collected, and distributed in a timely and appropriate manner",
      "Develops an appropriate plan for communication of project activities"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 38,
    "text": "Which tasks should a project manager accomplish to manage project scope correctly?",
    "options": [
      "Define, Validate, and Control Scope; Control Schedule; Control Costs; and Manage Stakeholder Engagement",
      "Collect Requirements, Define Scope, Create WBS, Develop Schedule, and Manage Stakeholder Engagement",
      "Plan Scope Management; Collect Requirements; Define, Validate, and Control Scope; and Create WBS",
      "Define, Validate, and Control Scope; Control Costs; Manage Stakeholder Engagement; and keep budget under control"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 39,
    "text": "In a preliminary meeting, the team chooses an agile methodology. A finance team member asks how project cost will be determined this early. How will the project team determine project cost?",
    "options": [
      "Use a lightweight cost estimation due to the nature of agile projects",
      "Use a detailed cost estimation for agile projects",
      "Retrieve a budget from a previous project and create a baseline for this project based on it",
      "Use a detailed work breakdown structure (WBS) to get cost estimation"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 40,
    "text": "Which of the following lists represents the outputs of the Monitor Communications process?",
    "options": [
      "Project communications, project management plan updates, project documents updates, and organizational process assets updates",
      "Work performance information, change requests, project management plan updates, and project documents updates",
      "Communications management plan, project management plan updates, work performance report, and project documents update",
      "Stakeholder engagement plan, change requests, project management plan updates, and project documents updates"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 41,
    "text": "A project team member is estimating the cost of an activity and is checking documentation from previous similar projects. Which estimation method is the project manager using to complete this task?",
    "options": [
      "Bottom‑up estimating",
      "Three‑point estimating",
      "Analogous estimating",
      "Parametric estimating"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 42,
    "text": "Which are inputs for the Plan Quality Management process?",
    "options": [
      "Quality metrics, project documents, and financial performance",
      "Quality management plan, project documents, and quality metrics",
      "Project management plan, project documents, and organizational process assets",
      "Project management plan, quality metrics, and project documents"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 43,
    "text": "What should the project manager use to evaluate the politics and power structure among stakeholders inside and outside of the organization?",
    "options": [
      "Expert judgment",
      "Interpersonal skills",
      "Team agreements",
      "Communication skills"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 44,
    "text": "The project manager has the following information about the estimated duration for an activity: Most likely = 15 days, Pessimistic = 20 days, Optimistic = 10 days. What is the estimated duration of this activity, according to the triangular distribution technique?",
    "options": [
      "10 days",
      "15 days",
      "12.5 days",
      "5 days"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 45,
    "text": "Which is a major component of an agreement?",
    "options": [
      "Change request handling",
      "Risk register templates",
      "Lessons learned register",
      "Procurement management plan"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 46,
    "text": "Which statement is related to the project manager's sphere of influence at the organizational level?",
    "options": [
      "A project manager interacts with other project managers to detect common interests and impacts their projects.",
      "A project manager facilitates communication between the suppliers and contractors on the project.",
      "A project manager considers the current industry trends and evaluates how they can impact or be applied to the project.",
      "A project manager may inform other professionals about the value of project management."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 47,
    "text": "What process group establishes project scope, refines objectives, and defines the actions necessary to attain project objectives?",
    "options": [
      "Executing",
      "Planning",
      "Initiating",
      "Monitoring and Controlling"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 48,
    "text": "Which are examples of processes that may be used once or at predefined points in the project life cycle?",
    "options": [
      "Develop Project Charter and Close Project or Phase",
      "Define Activities and Acquire Resources",
      "Control Schedule and Conduct Procurements",
      "Monitor Communications and Control Costs"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 49,
    "text": "After defining activities in project schedule management, which processes should a project manager follow?",
    "options": [
      "Sequence Activities and Estimate Activity Durations",
      "Estimate Activity Durations and Control Schedule",
      "Develop Schedule and Control Schedule",
      "Review Activities and Develop Schedule"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 50,
    "text": "Which of the following tasks is related to the Perform Qualitative Risk Analysis process?",
    "options": [
      "Identify the project risks and assign a probability of occurrence",
      "Perform a sensitivity analysis to determine which risk has the most potential for impacting the project",
      "Analyze the effect of identified project risks as numerical data",
      "Prioritize each project risk and assign the probability of occurrence and impact for each one"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 51,
    "text": "The project manager needs to manage a critical issue immediately, and this requires action from the upper management of a specific stakeholder group. Which plan should the project manager consult?",
    "options": [
      "Risk management plan",
      "Communications management plan",
      "Change management plan",
      "Stakeholder engagement plan"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 52,
    "text": "During what project management process does the project team begin identifying risks?",
    "options": [
      "Initiating",
      "Planning",
      "Executing",
      "Monitoring and Controlling"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 53,
    "text": "A project manager is reviewing the change requests for project documents, deliverables, and the project plan. In which project management process does this review belong?",
    "options": [
      "Monitor and Control Project Work",
      "Direct and Manage Project Work",
      "Close Project or Phase",
      "Perform Integrated Change Control"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 54,
    "text": "Which format can a network diagram take?",
    "options": [
      "Flow chart",
      "Control chart",
      "Affinity diagram",
      "Cause‑and‑effect diagram"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 55,
    "text": "A project manager is working on the communications management plan. Which of these documents are inputs to consider?",
    "options": [
      "Stakeholder engagement plan and organizational process assets",
      "Project schedule and stakeholder register",
      "Quality management plan and risk register",
      "Basis of estimates and scope baseline"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 56,
    "text": "According to the PMI Talent Triangle, leadership skills relate to the ability to:",
    "options": [
      "understand the high‑level overview of the organization",
      "tailor traditional and agile tools for the project",
      "work with stakeholders to develop an appropriate project delivery",
      "guide, motivate, and direct a team to reach project goals"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 57,
    "text": "Which is the best way for a project manager to ensure efficient and frequent communication with management and stakeholders in an agile/adaptive environment?",
    "options": [
      "Post project artifacts in a transparent fashion and engage stakeholders on a regular basis.",
      "Make surveys among the stakeholders and meet with the team once a month.",
      "Create a social network and post news there.",
      "Create personalized emails for each stakeholder, asking for requests and reviewing objectives with them periodically."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 58,
    "text": "A project manager is assigned to a strategic project. Senior management asks the project manager to give a presentation in order to request support that will ensure the success of the project. Which entities will the project manager attempt to influence?",
    "options": [
      "The project and the organization",
      "The organization and the industry",
      "The subject matter experts and the project",
      "The change control board and the organization"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 59,
    "text": "Which statement summarizes the role of the change control board?",
    "options": [
      "The change control board is responsible for presenting the change for approval",
      "The change control board will analyze the change impact in terms of cost and schedule",
      "The change control board is responsible for managing the change management and configuration management systems",
      "The change control board is responsible for reviewing and approving changes to the project"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 60,
    "text": "A project manager is working in an environment where requirements are not very clear and may change during the project. In addition, the project has several stakeholders and is technically complex. Which strategies should the project manager take into account for risk management in this environment?",
    "options": [
      "Occasionally identify, evaluate, and classify risks",
      "Review requirements and cross‑functional project teams",
      "Include contingency reserves and update the project management plan frequently",
      "Frequently review incremental work products and update the requirements for proper prioritization"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 61,
    "text": "Which group of inputs will a project manager use during the Monitor Stakeholder Engagement process?",
    "options": [
      "Project charter, business documents, and project management plan",
      "Agreements, scope baseline, and project management plan",
      "Project charter, business case, and project management plan",
      "Work performance data, enterprise environmental factors, and project management plan"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 62,
    "text": "How should a project manager plan communications for a project which has uncertain requirements?",
    "options": [
      "Include stakeholders in project meetings and reviews, use frequent checkpoints, and co‑locate team members only",
      "Invite customers to sprint planning and retrospective meetings, update the team quickly and on a daily basis, and use official communication channels",
      "Adopt social networking to engage stakeholders, issue frequent and short messages, and use informal communication channels",
      "Adopt a strong change control board process, establish focal points for main subjects, and promote formal and transparent communication"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 63,
    "text": "Which of the following are outputs from the process of creating a work breakdown structure (WBS)?",
    "options": [
      "Project scope statement and accepted deliverables",
      "Scope baseline and project documents update",
      "Accepted deliverables and enterprise environmental factors",
      "Scope baseline and work performance information"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 64,
    "text": "Which statement about identification and engagement of stakeholders during a project is correct?",
    "options": [
      "Project stakeholders should be identified and engaged in every phase of the project to influence the success of the project directly",
      "Project stakeholders should be identified and engaged once the prototype is completed to provide their feedback but refrain from making inputs during the project",
      "Project stakeholders should be identified when the project charter is being completed and engaged during requirements gathering",
      "Project stakeholders should be identified and engaged during requirements elicitation but not during the Define Scope process"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 65,
    "text": "Which of the following conditions should the project manager consider when working on the scheduling for an adaptive environment?",
    "options": [
      "Defining, sequencing, estimating activity durations, and developing a schedule model are so tightly linked that they are viewed as a single process",
      "The detailed project schedule should remain flexible throughout the project to accommodate newly gained knowledge",
      "An iterative scheduling and on‑demand, pull‑based scheduling will be required",
      "To address the full delivery schedule, a range of techniques may be needed and then need to be adapted"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 66,
    "text": "Which task will a project manager undertake while conducting Project Resource Management?",
    "options": [
      "Identify the different aspects of the team to manage and control physical resources efficiently",
      "Procure equipment, materials, facilities, and infrastructure for the project",
      "Train the team members in project skill sets",
      "Define the roles and responsibilities of each team member"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 67,
    "text": "Which is an example of an internal enterprise environmental factor?",
    "options": [
      "Market share brand recognition",
      "Factory location",
      "Local government regulation",
      "Industry research"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 68,
    "text": "A company must implement sales software because it is opening a new branch in a foreign market. Although this software is used in every domestic branch, multiple changes are expected during the implementation because it is a foreign location. Which type of life cycle would the project manager use in this case?",
    "options": [
      "Predictive life cycle",
      "Waterfall life cycle",
      "Hybrid life cycle",
      "Product life cycle"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 69,
    "text": "What are the two most common contract types used in a project?",
    "options": [
      "Cost plus award fee (CPAF) contract and fixed price contract",
      "Fixed price contract and cost‑reimbursable contract",
      "Cost‑reimbursable contract and time and material (T&M) contract",
      "Time and material (T&M) contract and cost plus award fee (CPAF) contract"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 70,
    "text": "If you established a contingency reserve including time, money, and resources, how are you handling risk?",
    "options": [
      "Accepting",
      "Transferring",
      "Avoiding",
      "Mitigating"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 71,
    "text": "Which are required to create the schedule management plan?",
    "options": [
      "Scope baseline, work breakdown structure (WBS), estimated costs, and milestone list",
      "Resource management plan, organizational process assets, activity list, and business case",
      "Enterprise environmental factors, organizational process assets, project charter, and project management plan",
      "Activity list, project statement of work, project charter, and communications management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 72,
    "text": "In an agile or adaptive environment, when should risk be monitored and prioritized?",
    "options": [
      "Only during the Initiation and Closing phases",
      "During the Initiation and Planning phases",
      "During each iteration as the project progresses",
      "Throughout the Planning process group and retrospective meeting"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 73,
    "text": "Which factors should be considered for cross‑cultural communication?",
    "options": [
      "Background, personality, and communications management plan",
      "Personality, background, and escalation process",
      "Sponsor relationship, personality, and background",
      "Current emotional state, personality, and background"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 74,
    "text": "The procurement requirements for a project include working with several vendors. What should the project manager take into consideration during the Project Procurement Management processes?",
    "options": [
      "Work performance information",
      "Bidder conferences",
      "Complexity of procurement",
      "Procurement management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 75,
    "text": "A project receives budget approval, but the risk of extra costs is expected. Which of these inputs should the project manager check in order to make a qualitative risk analysis?",
    "options": [
      "The risk management plan and the assumption log",
      "Costs estimates and cost forecasts",
      "The risk management plan and the basis of estimates",
      "The assumption log and the project charter"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 76,
    "text": "What is one of the main purposes of the project charter?",
    "options": [
      "Formal authorization of the existence of the project",
      "Formal acceptance of the project management plan",
      "Formal approval of the detailed project budget",
      "Formal definition of stakeholder roles and responsibilities"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 77,
    "text": "Tailoring considerations for project scope management may include:",
    "options": [
      "Requirements management, stability of requirements, development approach, and validation and control",
      "WBS guidelines, requirements templates, deliverable acceptance forms, and verified deliverables",
      "Business needs, product descriptions, project restrictions, and project management plan",
      "Issues defining and controlling what is included in the project, verified deliverables, and quality reports"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 78,
    "text": "Which of the following is a category of organizational process assets?",
    "options": [
      "Government standards",
      "Organizational culture",
      "Employee capabilities",
      "Organizational knowledge bases"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 79,
    "text": "To which knowledge area does the Collect Requirements process belong?",
    "options": [
      "Quality Management",
      "Scope Management",
      "Cost Management",
      "Integration Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 80,
    "text": "Which of the following can a project manager use to represent defined team member roles in a group of tasks?",
    "options": [
      "Work breakdown structure (WBS)",
      "Responsibility assignment matrix (RAM)",
      "Organizational breakdown structure (OBS)",
      "Resource breakdown structure (RBS)"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 81,
    "text": "Under which circumstances should multiple projects be grouped in a program?",
    "options": [
      "When they are needed to accomplish a set of goals and objectives for an organization",
      "When they have the same project manager and the same organizational unit",
      "When they have the same scope, budget, and schedule",
      "When they are from the same unit of the organization"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 82,
    "text": "How can a project manager maintain the engagement of stakeholders in a project with a high degree of change?",
    "options": [
      "Monitor project stakeholder relationships using engaging strategies and plans",
      "Send all project documents to stakeholders each time they are modified",
      "Schedule monthly meetings with the stakeholders, including team members",
      "Engage only with the project sponsors"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 83,
    "text": "Which are the competing constraints that a project manager should address when tailoring a project?",
    "options": [
      "Cost, scope, schedule",
      "Sponsorship, risk, quality",
      "Schedule, sponsorship, scope",
      "Resources, quality, communication"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 84,
    "text": "Which knowledge area includes the processes to identify, define, and unify the various project management processes?",
    "options": [
      "Project Integration Management",
      "Project Communications Management",
      "Project Quality Management",
      "Project Risk Management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 85,
    "text": "For what project management process is work performance information an output?",
    "options": [
      "Implement Risk Responses",
      "Plan Stakeholder Engagement",
      "Monitor Stakeholder Engagement",
      "Plan Quality Management"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 86,
    "text": "A project stakeholder is requesting changes to the project plan. Which process group addresses this?",
    "options": [
      "Initiating Process Group",
      "Planning Process Group",
      "Executing Process Group",
      "Monitoring and Controlling Process Group"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 87,
    "text": "Due to today’s competitive global market, organizations require more than technical project management skills. Which of the following skills can support long‑range strategic objectives that contribute to the bottom line?",
    "options": [
      "Planning and risk management skills",
      "Communication and time management skills",
      "Business intelligence and leadership skills",
      "Strategic and business management skills"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 88,
    "text": "For which kind of quantitative risk analysis chart can a tornado diagram represent values?",
    "options": [
      "Sensitivity analysis",
      "Monte Carlo analysis",
      "Expected monetary value analysis",
      "Decision tree analysis"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 89,
    "text": "The project manager is working with some functional managers and stakeholders on the resource management plan. Which elements may be included in this plan?",
    "options": [
      "Team values, team agreements, and conflict resolution process",
      "Conflict resolution process, communication guidelines, and meeting schedules",
      "Team roles and responsibilities, team management, and training plan",
      "Resource requirements, resource assignments, and team performance assessments"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 90,
    "text": "A new project manager wishes to recommend creating a project management office to senior management. Which statement would the project manager use to describe the importance of creating the project management office?",
    "options": [
      "It will give the project manager independence to make decisions without other departmental input.",
      "It integrates organizational data and information to ensure that strategic objectives are fulfilled.",
      "The project management office can execute administrative tasks.",
      "The project management office can coordinate projects."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 91,
    "text": "In order to detect quality issues earlier in the project life cycle, the project manager is using an agile/adaptive environment. What is the main difference between waterfall and agile/adaptive development approaches for Project Quality Management?",
    "options": [
      "The frequency of the quality and review steps",
      "The number of deliverables",
      "The duration of each of the quality and review steps",
      "The tools used in the quality and review steps"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 92,
    "text": "An important project stakeholder has low risk tolerance. Which type of communication should a project manager use to provide this stakeholder with a difficult update?",
    "options": [
      "Informal conversation",
      "Face‑to‑face meeting",
      "Short email update",
      "Written report"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 93,
    "text": "Which tools and techniques should a project manager use to monitor risks?",
    "options": [
      "Expert judgment, data analysis, and interpersonal and team skills",
      "Data analysis, audits, and meetings",
      "Expert judgment, audits, and decision making",
      "Meetings, data gathering, and expert judgment"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 94,
    "text": "What internal enterprise environmental factor (EEF) can impact a project?",
    "options": [
      "Cultural influences",
      "Physical environmental elements",
      "Commercial databases",
      "Infrastructure"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 95,
    "text": "A project manager needs to request outside support for a statement of work (SOW) that is not precise. Which kind of contract does the project manager need to create?",
    "options": [
      "Time and material (T&M)",
      "Cost plus fixed fee (CPFF)",
      "Fixed price",
      "Cost plus award fee (CPAF)"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 96,
    "text": "Which is a list of organizational systems that may have an impact on a project?",
    "options": [
      "Internal policies, company procedures, and organizational resources",
      "Company culture, purchasing system, and project management information system",
      "Organizational structure, governance framework, and management elements",
      "Organizational process assets, enterprise environmental factors, and corporate knowledge"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 97,
    "text": "Which set of activities should a project manager use as part of the Develop Team process?",
    "options": [
      "Training and establishing ground rules",
      "Networking activities and estimating team resources",
      "Conflict management activities and tracking team performance",
      "Recruit new team members and training"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 98,
    "text": "Which set of competencies should a project manager have?",
    "options": [
      "Leadership, strategic and business management, and technical project management",
      "Expertise in the industry, leadership and business management, and bilingual skills",
      "Technical project management, expertise in every rote, and PMP certification",
      "Expertise in every detail on project activities, PMP certification, and leadership"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 99,
    "text": "A project is just beginning, and management creates a long list of potential stakeholders. Which statement about identifying and engaging stakeholders is correct?",
    "options": [
      "The project manager should identify and deal with stakeholders only during the execution phase.",
      "Stakeholder satisfaction should be identified immediately and managed as a project objective.",
      "The project manager should focus on project objectives and deal with stakeholders as a secondary priority.",
      "Stakeholder satisfaction is the most important goal, and project objectives should be considered a secondary priority."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 100,
    "text": "Which of the following set of elements is part of an effective communications management plan?",
    "options": [
      "Escalation processes, person responsible for communicating the information, glossary of common terminology, methods or technologies used to convey the information",
      "Phone book directory, stakeholder communication requirements, project charter, glossary of common terminology",
      "Organizational chart, escalation processes, person responsible for communicating the information, project management plan, glossary of common terminology",
      "Glossary of common terminology, constraints derived from specific legislation and regulation, person responsible for communicating information, project management plan, resource management plan"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 101,
    "text": "Which is the order of steps in the Procurement Management process?",
    "options": [
      "Identifying and planning procurement requirements, obtaining quotes or proposals, negotiating with vendors, contracting with selected vendors, and controlling procurements.",
      "Identifying and planning procurement requirements, negotiating with vendors, contracting with selected vendors, obtaining quotes or proposals, and controlling procurements.",
      "Controlling procurements, identifying and planning procurement requirements, obtaining quotes or proposals, negotiating with vendors, and contracting with selected vendors.",
      "Obtaining quotes or proposals, identifying and planning procurement requirements, negotiating with vendors, contracting with selected vendors, and controlling procurements."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 102,
    "text": "Which is the appropriate tool to identify the possible correlation between two elements in a process?",
    "options": [
      "Scatter diagram",
      "Cause‑and‑effect diagram",
      "Histogram",
      "Control charts"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 103,
    "text": "What process is included in Project Integration Management?",
    "options": [
      "Monitor and Control Project Work",
      "Control Scope",
      "Control Schedule",
      "Develop Team"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 104,
    "text": "What are the inputs of the Estimate Costs process?",
    "options": [
      "Project management plan, work performance data, enterprise environmental factors, and organizational process assets",
      "Project management plan, project documents, enterprise environmental factors, and organizational process assets",
      "Cost baseline, enterprise environmental factors, benefits management plan, and organizational process assets",
      "Project management plan, enterprise environmental factors, basis of estimates, and organizational process assets"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 105,
    "text": "In what type of organizational structure does a project manager develop their role and work with a team assigned by job function?",
    "options": [
      "Matrix – strong",
      "Matrix – balanced",
      "Virtual",
      "Functional"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 106,
    "text": "The project manager implemented the stakeholder engagement plan and realized that some updates should be made. Which components of the project management plan should be modified?",
    "options": [
      "Project charter and stakeholder engagement plan",
      "Risk management plan and stakeholder engagement plan",
      "Communications management plan and stakeholder engagement plan",
      "Project charter and communications management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 107,
    "text": "In which Project Cost Management process is work performance data included?",
    "options": [
      "Plan Cost Management",
      "Estimate Costs",
      "Determine Budget",
      "Control Costs"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 108,
    "text": "In a project using agile methodology, who may perform the quality control activities?",
    "options": [
      "A group of quality experts at specific times during the project",
      "The project manager only",
      "All team members throughout the project life cycle",
      "Selected stakeholders at specific times during the project"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 109,
    "text": "What does earned value (EV) measure?",
    "options": [
      "Budgeted work that has been completed",
      "Total costs incurred while accomplishing work",
      "Budget associated with planned work",
      "Cost efficiency of budgeted resources"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 110,
    "text": "How can a project manager represent a contingency reserve in the schedule?",
    "options": [
      "Additional weeks of work to account for unknown‑unknowns risks",
      "Task duration estimates of the best case scenarios",
      "Additional duration estimates in response to identified risks that have been accepted",
      "Milestones representing the completion of deliverables"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 111,
    "text": "Which action should the project manager take after the team finishes executing the scope?",
    "options": [
      "Verify the deliverables to ensure that they are correct and meet the customer's satisfaction.",
      "Accept all the deliverables and deliver them to the customer for final acceptance.",
      "Conduct a joint session with the customer, change the deliverables, and then request approval.",
      "Check that all change requests were implemented and release deliverables to the customer."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 112,
    "text": "Which are the main objectives of Project Risk Management?",
    "options": [
      "Increase the probability of positive risks and decrease the probability of negative risks.",
      "Avoid all kind of risks.",
      "Increase the probability of positive risks and eliminate all negative risks.",
      "Identify positive and negative risks."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 113,
    "text": "What is the difference between verified and accepted deliverables?",
    "options": [
      "Accepted deliverables have been completed and checked for correctness; verified deliverables have been formally approved by the customer or authorized stakeholder.",
      "Accepted deliverables have been inspected by the quality team; verified deliverables are outputs from the Validate Scope process.",
      "Accepted deliverables have been formally signed off and approved by the authorized stakeholder; verified deliverables have been completed and checked for correctness.",
      "Accepted deliverables have been formally accepted by the project manager; verified deliverables are the outputs from the Control Quality process"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 114,
    "text": "What statement describes the function or responsibility of a project manager?",
    "options": [
      "Works with the sponsor to address internal political and strategic issues that may impact the team",
      "Seeks ways to develop relationships that assist the team in achieving organizational goals and objectives",
      "Ensures that the project's business operations are efficient",
      "Provides management oversight for a project's functional or business units"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 115,
    "text": "A project manager is analyzing a few network diagrams in order to determine the minimum duration of a project. Which diagram should the project manager reference?",
    "options": [
      "A diagram in which resource optimization has been applied.",
      "A diagram in which the critical path method has been applied.",
      "A diagram in which a predefined series of activities has been organized.",
      "A diagram which shows a combination of resource and time optimization."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 116,
    "text": "The features and functions that characterize a result product, or service can refer to:",
    "options": [
      "project scope",
      "product scope",
      "service scope",
      "product breakdown structure"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 117,
    "text": "A project manager needs to demonstrate that the project meets quality standards and success criteria. For that reason, the project manager is defining the quality objectives of the project, the quality tools that will be used, and quality metrics for the project deliverables. Which process is the project manager executing?",
    "options": [
      "Manage Quality",
      "Plan Quality Management",
      "Control Quality",
      "Plan Scope Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 118,
    "text": "In an agile and adaptive project, which scope management entity involves stakeholder engagement?",
    "options": [
      "Collect Requirements",
      "Create Work Breakdown Structure (WBS)",
      "Plan Scope Management",
      "Scope Baseline"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 119,
    "text": "Which set of tools and techniques is useful for estimating activity durations for the project schedule?",
    "options": [
      "Brainstorming, Monte Carlo simulation, analogous estimation",
      "Three‑point estimation, resources leveling, iteration burndown chart",
      "Milestone charts, parametric estimation, schedule baseline",
      "Parametric estimation, three‑point estimation, meetings"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 120,
    "text": "A project manager can choose from several techniques to resolve conflicts between team members. Which technique can result in a win‑win situation?",
    "options": [
      "Collaborate/Problem Solve",
      "Compromise/Reconcile",
      "Smooth/Accommodate",
      "Withdraw/Avoid"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 121,
    "text": "What should a project manager do to prepare a risk management plan in a project with a lot of technical uncertainty?",
    "options": [
      "Get expert judgment",
      "Count on personal experience",
      "Ask project sponsors",
      "Delay the project until technical uncertainty is clarified"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 122,
    "text": "A project using the agile/adaptive approach has reached the Project Integration Management phase. What is the project manager’s key responsibility during this phase?",
    "options": [
      "Defining the scope of the project",
      "Building a collaborative environment",
      "Creating a detailed project management plan",
      "Directing the delivery of the project"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 123,
    "text": "Which statement describes the relationship between Manage Quality process and Control Quality process?",
    "options": [
      "Manage Quality is about following planned processes and procedures; Control Quality ensures the product conforms to specifications.",
      "Control Quality is about following planned processes and procedures; Manage Quality ensures the product conforms to specifications.",
      "Manage Quality and Control Quality are the same.",
      "Manage Quality is part of Quality Management; Control Quality is a subset of Stakeholder Management."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 124,
    "text": "At what stages of a project should the Identify Stakeholders process be performed?",
    "options": [
      "When beginning each phase of the project",
      "At the beginning of the project only",
      "Only when concerned about stakeholder satisfaction",
      "When the project charter is produced, at the beginning of each phase, and when significant changes occur"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 125,
    "text": "A stakeholder is reading project documents given by the project manager. The stakeholder is curious about the difference between a verified deliverable and an accepted deliverable. Which definition can the project manager use?",
    "options": [
      "An accepted deliverable is approved by the project team; a verified deliverable is approved and signed off by the customer or sponsor.",
      "An accepted deliverable has been checked for accuracy through Control Quality; a verified deliverable meets acceptance criteria formally signed off by the customer or sponsor.",
      "An accepted deliverable meets acceptance criteria and is signed off by the customer or sponsor; a verified deliverable is checked for accuracy through Control Quality.",
      "An accepted deliverable is signed off by the project manager; a verified deliverable is signed off by the customer or sponsor."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 126,
    "text": "Considering a highly dynamic project environment, which approach should the project manager adopt to manage the project team?",
    "options": [
      "A self‑organizing approach to increase team focus and maximize collaboration",
      "A virtual team to minimize isolation and knowledge gaps",
      "A distributed team to improve tracking progress, productivity, and performance",
      "A norming approach requiring team members to adjust behavior and work together"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 127,
    "text": "How is the Project Scope Management process different in agile and adaptive projects than in traditional projects?",
    "options": [
      "Less time spent on defining scope early on",
      "More time spent on defining scope early on",
      "Less time spent on scope management overall",
      "Scope management is the same in all projects"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 128,
    "text": "What is the purpose of the project management process groups?",
    "options": [
      "To define a new project",
      "To track and monitor processes easily",
      "To logically group processes to achieve specific project objectives",
      "To link specific process inputs and outputs"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 129,
    "text": "After an internal deliverable review session, the project manager identifies issues needing rework before formal approval. How would these extra costs be defined?",
    "options": [
      "Appraisal costs",
      "Management reserves",
      "Cost of nonconformance",
      "Cost of conformance"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 130,
    "text": "During which Project Cost Management process is the cost baseline produced?",
    "options": [
      "Estimate Costs",
      "Control Schedule",
      "Determine Budget",
      "Develop Project Charter"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 131,
    "text": "Company A’s accountant sends notification about a change in the company’s tax classification. Why would a project have to be initiated?",
    "options": [
      "To change business and technological strategies",
      "To improve processes and services",
      "To meet regulatory and legal requirements",
      "To satisfy stakeholder requests"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 132,
    "text": "The project manager is using co‑location and providing training to the project team. On which Project Resource Management process is the manager working?",
    "options": [
      "Acquire Resources",
      "Control Resources",
      "Manage Team",
      "Develop Team"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 133,
    "text": "In an adaptive or agile life cycle, how are the customer and sponsor involved in project scope management activities?",
    "options": [
      "Involvement is needed only during project initiation",
      "Minimal stakeholder involvement is sufficient",
      "They should be continuously engaged",
      "They should be involved only during phase or deliverable reviews"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 134,
    "text": "A project manager is launching a lessons‑learned database accessed at recipients’ discretion. Which communication method is described?",
    "options": [
      "Push communication",
      "Pull communication",
      "Interactive communication",
      "Stakeholder communication"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 135,
    "text": "A project manager must decide the level of detail in a status report for a new stakeholder. Which document provides this information?",
    "options": [
      "Organizational process assets",
      "Change management plan",
      "Communications management plan",
      "Resource management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 136,
    "text": "The project manager is explaining essential business aspects of the project to others. To which skill category does this ability belong?",
    "options": [
      "Technical project management skills",
      "Time management skills",
      "Strategic and business management skills",
      "Leadership skills"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 137,
    "text": "What tool should a project manager use to efficiently manage project resources?",
    "options": [
      "List of project resources",
      "Resource breakdown structure",
      "Resources detailed in the project scope",
      "Resource requirements"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 138,
    "text": "Which process is engaged when a project team member makes a change to project budget with the project manager's approval?",
    "options": [
      "Manage Cost Plan",
      "Estimate Costs",
      "Determine Budget",
      "Control Costs"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 139,
    "text": "Which conflict resolution technique produces the most lasting results?",
    "options": [
      "Withdraw/avoid",
      "Smooth/accommodate",
      "Compromise/reconcile",
      "Collaborate/problem solve"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 140,
    "text": "What is the best tool to calculate the critical path on a project?",
    "options": [
      "Critical chain method",
      "Graphical evaluation and review technique (GERT) diagram",
      "Gantt chart",
      "Project network diagram"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 141,
    "text": "In which of the Risk Management processes is the project charter used as an input?",
    "options": [
      "Plan Risk Responses",
      "Implement Risk Responses",
      "Plan Risk Management",
      "Perform Quantitative Risk Responses"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 142,
    "text": "Projects, programs, subsidiary portfolios, and operations managed as a group to achieve strategic objectives refers to?",
    "options": [
      "Operations management",
      "Project management",
      "Program management",
      "Portfolio management"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 143,
    "text": "What is the discipline that focuses on the interdependencies between projects to determine the optimal approach for managing them?",
    "options": [
      "Project Management",
      "Program Management",
      "Portfolio Management",
      "Operations Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 144,
    "text": "A project team is discussing an upcoming planned product launch of a highly visible technologically advanced artificial‑intelligence tool. The team is debating the aspect of iterative and hybrid approaches. Which aspect of tailoring would this best represent?",
    "options": [
      "Life cycle approaches",
      "Resource availability",
      "Project dimensions",
      "Technology support"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 145,
    "text": "A functional manager is delegating a key project to a project team without a project manager. Which communication method will be most effective?",
    "options": [
      "Interactive",
      "Push",
      "Verbal",
      "Oral"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 146,
    "text": "Creating the project scope statement is part of which process?",
    "options": [
      "Manage Scope",
      "Collect Requirements",
      "Define Scope",
      "Validate Scope"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 147,
    "text": "What organizational asset can influence the Plan Risk Management process?",
    "options": [
      "Corporate policies and procedures for social media, ethics, and security",
      "Organizational risk policy",
      "Stakeholder register templates and instructions",
      "Organizational communication requirements"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 148,
    "text": "A project manager called for a team meeting to estimate the project effort. During the session, the team identified all the deliverables and analyzed the related work. Each analyzed deliverable was estimated. Which estimation method did the team use?",
    "options": [
      "Rolling wave planning",
      "Expert judgment",
      "Decomposition",
      "Data analysis"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 149,
    "text": "Due to new market conditions a five‑year project requires a full revision of project objectives. Which components of the stakeholder engagement plan need to be updated?",
    "options": [
      "Scope and impact of change to stakeholders",
      "Project scope and stakeholder goals",
      "Engagement level of key stakeholders",
      "Stakeholder expectations for the project"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 150,
    "text": "The project team is brainstorming approaches to deliver the upcoming product launch for which the project has been chartered. The project manager is laying out hybrid, adaptive, iterative methods. What is the team trying to address?",
    "options": [
      "Co‑location",
      "Life‑cycle",
      "Diversity",
      "Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 151,
    "text": "A project manager is experiencing a project with a high degree of change. Which type of stakeholder engagement does this project require?",
    "options": [
      "Discussing with management",
      "Escalating to the sponsors",
      "Engaging regularly with stakeholders",
      "Engaging only with decision makers"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 152,
    "text": "A project manager is identifying the risks of a project. Which technique should the project manager use?",
    "options": [
      "Representations of uncertainty",
      "Prompt lists",
      "Audits",
      "Risk categorization"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 153,
    "text": "The project manager is distributing project communications, collecting and storing project information, and retrieving documents when required. In which process is the project manager involved?",
    "options": [
      "Monitor Communications",
      "Plan Communications Management",
      "Manage Communications",
      "Manage Stakeholder Engagement"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 154,
    "text": "The Agile principle “welcome changing requirements, even late in development” relates to which agile manifesto value?",
    "options": [
      "Working software over comprehensive documentation",
      "Individuals and interactions over processes and tools",
      "Customer collaboration over contract negotiation",
      "Responding to change over following a plan"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 155,
    "text": "Which of the following best correspond to the organizational process assets (OPAs) that affect the project?",
    "options": [
      "Policies and lessons learned from other projects",
      "Information technology software and employee capability",
      "Resource availability and employee capability",
      "Marketplace conditions and legal restrictions"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 156,
    "text": "What is a tailoring consideration in Project Integration Management?",
    "options": [
      "Validation and control",
      "Benefits",
      "Technology support",
      "Physical location"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 157,
    "text": "What important leadership quality/qualities should a project manager possess?",
    "options": [
      "Skills and behaviors related to specific domains of project management",
      "Skills and behaviors needed to guide a team and help an organization reach its goals",
      "Industry expertise that helps to better deliver business outcomes",
      "Industry and organizational expertise that enhances performance"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 158,
    "text": "A project manager is monitoring and recording results of executing the quality management activities to assess performance and ensure the project outputs are complete, correct, and meet customer expectations. Which output is the project manager using?",
    "options": [
      "Approved change requests",
      "Verified deliverables",
      "Lessons learned",
      "Work performance data"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 159,
    "text": "Which project manager competency is displayed through the knowledge, skills, and behaviors related to specific domains of project, program, and portfolio management?",
    "options": [
      "Leadership management",
      "Technical project management",
      "Strategic management",
      "Business management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 160,
    "text": "Which of these is true of project integration management?",
    "options": [
      "Project Integration Management is mandatory and more effective in larger projects",
      "Project Integration Management and expert judgment are mutually exclusive",
      "Project Integration Management is the responsibility of the project manager",
      "Project Integration Management excludes the triple constraints if cost performance index (CPI) equals zero"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 161,
    "text": "Why is tailoring in a project necessary?",
    "options": [
      "Requirements keep changing",
      "An artifact must be produced",
      "A tool or technique is required",
      "Each project is unique"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 162,
    "text": "An organization structure that standardizes the project‑related governance processes and facilitates the sharing of resources, methodologies, tools, and techniques is referred to as:",
    "options": [
      "Project Management Information System",
      "Project Management System",
      "Project Management Office",
      "Project Management Knowledge Area"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 163,
    "text": "A firm contracted an event management company to conduct the annual sales‑day event. The agreement states that the company will charge the firm for the actuals and receive 8% of the total cost. What type of contract is this?",
    "options": [
      "Time and material (T&M)",
      "Fixed price incentive fee (FPIF)",
      "Cost plus fixed fee (CPFF)",
      "Cost plus award fee (CPAF)"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 164,
    "text": "A project manager is working with stakeholders to meet their needs and expectations, and to foster communication and involvement. Which process does this represent?",
    "options": [
      "Monitor Stakeholder Engagement",
      "Monitor Communications",
      "Manage Communications",
      "Manage Stakeholder Engagement"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 165,
    "text": "A project manager is formalizing acceptance of the completed project deliverables. What is an input to this process?",
    "options": [
      "Verified deliverables",
      "Validated deliverables",
      "Accepted deliverables",
      "Completed change requests"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 166,
    "text": "During a review, the painter cannot start work because plastering is not finished. What relationship between tasks impacted the painting work?",
    "options": [
      "Finish‑to‑Finish (FF)",
      "Start‑to‑Finish (SF)",
      "Finish‑to‑Start (FS)",
      "Start‑to‑Start (SS)"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 167,
    "text": "Which of the following is used as an input to prepare a cost management plan?",
    "options": [
      "Expert judgment",
      "Lessons learned",
      "Cost estimates",
      "Project management plan"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 168,
    "text": "In which organizational structure would the project manager have the most authority?",
    "options": [
      "Matrix‑weak",
      "Matrix‑balanced",
      "Matrix‑strong",
      "Organic or simple"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 169,
    "text": "Analyzing activity sequences, durations, resource requirements, and schedule constraints for project execution and monitoring and controlling relates to which process?",
    "options": [
      "Develop Schedule",
      "Control Schedule",
      "Estimate Activity Durations",
      "Define Activities"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 170,
    "text": "A project manager is determining the amount of contingency needed for a project. Which analysis is being used?",
    "options": [
      "What‑if scenario analysis",
      "Simulation",
      "Alternatives analysis",
      "Reserve analysis"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 171,
    "text": "A team created a prototype and used customer feedback to refine requirements. What technique is the team using?",
    "options": [
      "Early requirements gathering",
      "Feedback analysis",
      "Progressive elaboration",
      "Requirements documentation"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 172,
    "text": "Which of the following describes the similarities of the process groups and the project life cycle?",
    "options": [
      "The life cycle involves three project management process groups",
      "Both provide a basic framework to manage the project",
      "Each project must have a life cycle and all processes in the five process groups",
      "The project life cycle is managed by executing the processes within the five process groups"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 173,
    "text": "What can the project manager find among the factors that could lead a project to be tailored?",
    "options": [
      "Company culture",
      "Return on investment",
      "Earned Value",
      "Schedule Performance Index"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 174,
    "text": "Which of the following are components of the technical project management skill?",
    "options": [
      "Ability to explain business aspects of the project, business strategy, goals and objectives, and business value",
      "Ability to deal with people, be collaborative, and apply persuasion and negotiation",
      "Ability to focus on relationships with people, inspire trust, and implement decisions and actions that support the business strategy",
      "Ability to plan and prioritize, gather the right artifacts for each project, and focus on critical success factors"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 175,
    "text": "What is a tailoring consideration for the application of Project Risk Management processes?",
    "options": [
      "Project complexity",
      "Procurement criteria",
      "Communication technology",
      "Knowledge management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 176,
    "text": "A project team conducts regular stand‑up meetings to keep everyone updated on what each one of them is working on. What type of communication is this?",
    "options": [
      "Informal",
      "Unofficial",
      "Formal",
      "Hierarchical"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 177,
    "text": "What is the first step in the Stakeholder Management process?",
    "options": [
      "Plan Stakeholder Engagement",
      "Identify Stakeholders",
      "Manage Stakeholder Responsibility",
      "Monitor Stakeholder Activity"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 178,
    "text": "A project manager is searching for solutions that bring some degree of satisfaction to all parties in order to temporarily resolve a conflict. What conflict‑management technique is described in this situation?",
    "options": [
      "Withdraw/avoid",
      "Smooth/accommodate",
      "Collaborate/problem solve",
      "Compromise/reconcile"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 179,
    "text": "What is the project manager’s responsibility in Project Integration Management?",
    "options": [
      "Ensuring that requirements‑related work is clarified in the project management plan",
      "Investing sufficient effort in acquiring, managing, motivating, and empowering the project team",
      "Combining the results in all other knowledge areas and overseeing the project as a whole",
      "Developing a strategy to ensure effective stakeholder communication"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 180,
    "text": "What is the role of project management in terms of organizational strategy?",
    "options": [
      "Project management aligns initiatives, prioritizes work, and provides resources",
      "Project management provides the strategic vision for an organization to achieve its goals",
      "Project management enables the achievement of organizational goals and objectives",
      "Project management harmonizes components and controls interdependencies to realize specific benefits"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 181,
    "text": "Perform Quantitative Risk Analysis focuses on:",
    "options": [
      "Compiling a list of known risks and preparing responses to them",
      "Assessing the probability of occurrence and impact for every risk in the risk register",
      "Evaluating the contingency and management reserves required for the project",
      "Analyzing numerically the impact of individual risks on the overall project’s time and cost objectives"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 182,
    "text": "Which is the tool or technique used to obtain the list of activities from the work packages?",
    "options": [
      "Data analysis",
      "Leads and lags",
      "Precedence diagramming method",
      "Decomposition"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 183,
    "text": "A project manager uses their networking skills to build agreement with a difficult stakeholder. What level of influence did the project manager apply?",
    "options": [
      "Project level",
      "Organizational level",
      "Industry level",
      "Influential level"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 184,
    "text": "Stakeholder identification and engagement should begin during what phase of the project?",
    "options": [
      "After the project management plan is completed",
      "After the stakeholder engagement plan is completed",
      "As soon as the project charter has been approved",
      "After the communications management plan is completed"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 185,
    "text": "What communication methods would a project manager use for overall effective project communication?",
    "options": [
      "Interactive communication, push communication, interpersonal communication",
      "Interactive communication, push communication, pull communication",
      "Push communication, pull communication, interpersonal communication",
      "Pull communication, interactive communication, interpersonal communication"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 186,
    "text": "At the beginning of an iteration, the team will work to determine how many of the highest‑priority items on the backlog list can be delivered within the next iteration. Which activity is done first?",
    "options": [
      "Create Work Breakdown Structure (WBS)",
      "Create Scope Baseline",
      "Collect Requirements",
      "Define Scope"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 187,
    "text": "A project team submits a weekly progress report to the project manager. The project manager consolidates the same report and sends a complete progress report to the stakeholders. What is this an example of?",
    "options": [
      "Informal communication",
      "Internal communication",
      "Formal communication",
      "Horizontal communication"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 188,
    "text": "In a large organization, with projects of different types and sizes, what kind of approach or method would be best to use?",
    "options": [
      "Predictive",
      "Adaptive",
      "A mix",
      "Agile"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 189,
    "text": "Which type of project life cycle uses an iteration plan?",
    "options": [
      "Agile",
      "Predictive",
      "Waterfall",
      "Product"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 190,
    "text": "Which two processes should be used to influence costs in the early stages of a project?",
    "options": [
      "Estimate Costs and Determine Budget",
      "Plan Cost Management and Estimate Activity Durations",
      "Control Quality and Control Costs",
      "Plan Stakeholder Engagement and Plan Communications Management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 191,
    "text": "If you are using an Ishikawa diagram to determine the root cause of problems, which process are you engaged in?",
    "options": [
      "Plan Quality Management",
      "Control Quality",
      "Risk Management",
      "Plan Scope Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 192,
    "text": "In which sphere of influence is the project manager demonstrating the value of project management and advancing the efficacy of the project management office (PMO)?",
    "options": [
      "The organization",
      "The project",
      "The industry",
      "The product"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 193,
    "text": "What process is included in Project Schedule Management?",
    "options": [
      "Estimate Activity Durations",
      "Create Work Breakdown Structure (WBS)",
      "Direct and Manage Project Work",
      "Estimate Activity Resources"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 194,
    "text": "What does expert judgment provide as an input to the resource management plan?",
    "options": [
      "Geographic distribution of facilities and resources",
      "Physical resource management policies and procedures",
      "Estimated lead times based on lessons learned",
      "Templates for the resource management plan"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 195,
    "text": "Which tasks should a project manager perform in order to manage the project schedule effectively?",
    "options": [
      "Plan Schedule Management, Define Activities, Sequence Activities, Estimate Activity Durations, Define Quality of Activities, Develop Schedule",
      "Plan Schedule Management, Define Activities, Sequence Activities, Estimate Activity Durations, Develop Schedule, Control Schedule",
      "Plan Schedule Management, Define Activities, Sequence Activities, Estimate Activity Durations, Estimate Cost of Activities, Develop Schedule",
      "Define Activities, Sequence Activities, Estimate Activity Durations, Define Quality of Activities, Estimate Cost of Activities, Develop Schedule"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 196,
    "text": "The project manager is working in an agile/adaptive environment. The project manager is considering different approaches for applying Project Integration Management in this environment. How can the project manager ensure that this will work for the project?",
    "options": [
      "Take control of all decisions and product planning",
      "Build a team that can respond to changes within a collaborative, decision‑making environment",
      "Promote a team with a narrow specialization within a hierarchical environment",
      "Delegate project decisions to the product owner and sponsor"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 197,
    "text": "Which of the following is an example of an internal factor that influences the outcome of the project?",
    "options": [
      "Legal restrictions",
      "Financial considerations",
      "Commercial database",
      "Geographic distribution of facilities"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 198,
    "text": "The project manager and the project team are having a meeting with the purpose of identifying risks. Which tools and techniques might help in this process?",
    "options": [
      "Prompt lists and data analysis",
      "Reports and representations of uncertainty",
      "Data analysis and risk audits",
      "Interpersonal and team skills and project management information system"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 199,
    "text": "Which term refers to the work performed to deliver results with specified features and functions?",
    "options": [
      "Project scope",
      "Product scope",
      "Change request",
      "Acceptance criteria"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 200,
    "text": "A project manager needs to tailor the Project Cost Management process. Which considerations should the project manager apply?",
    "options": [
      "Diversity background",
      "Stakeholder's relationships",
      "Technical expertise",
      "Knowledge management"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 201,
    "text": "The primary purpose of the stakeholder register is to:",
    "options": [
      "Record stakeholder issues on the project",
      "Maintain lessons learned earlier in the project",
      "Maintain a list of all project stakeholders",
      "Document change requests and their status"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 202,
    "text": "The project management plan requires the acquisition of a special part available from a supplier located abroad. Which source selection method is being used?",
    "options": [
      "Least cost",
      "Qualifications only",
      "Sole source",
      "Fixed budget"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 203,
    "text": "Project reporting is a tool that is most closely associated with which process?",
    "options": [
      "Communicate Plan",
      "Manage Communications",
      "Report Performance",
      "Control Communications"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 204,
    "text": "A project reports an earned value (EV) of US$45 for work completed with an actual cost (AC) of US$40. What is the cost performance index (CPI)?",
    "options": [
      "0.88",
      "1.12",
      "0.58",
      "1.58"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 205,
    "text": "Which of the following is used to classify stakeholders based on their assessments of power, urgency, and legitimacy?",
    "options": [
      "Power interest grid",
      "Stakeholder cube",
      "Salience model",
      "Directions of influence"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 206,
    "text": "A project manager is performing a specific process and has a list of accepted deliverables. One of the stakeholders points out that they have just reviewed the verified deliverables, and come up with the list of accepted deliverables. Which process is being referred to?",
    "options": [
      "Control Quality",
      "Validate Scope",
      "Validate Quality",
      "Control Scope"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 207,
    "text": "Which of the following must be included in the risk register when the project manager completes the Identify Risks process?",
    "options": [
      "List of identified risks, potential risk owners, list of potential risk response",
      "List of identified risks, list of causes, list of risk categories",
      "Short risk titles, list of potential risk owners, list of impacts on objectives",
      "List of activities affected, list of potential risk responses, list of causes"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 208,
    "text": "What is a tool or technique used in the Control Quality process?",
    "options": [
      "Attribute sampling",
      "Parametric estimating",
      "Statistical sampling",
      "Expert judgment"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 209,
    "text": "The project manager is working in the processes of Project Resource Management. Which process is the project manager developing if they are using parametric estimation?",
    "options": [
      "Plan Resource Management",
      "Estimate Activity Resources",
      "Estimate Costs",
      "Acquire Resources"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 210,
    "text": "A project manager held a meeting and listed all the team members' ideas for improving the product on a white board. What data gathering technique did the project manager apply?",
    "options": [
      "Focus groups",
      "Interviews",
      "Brainstorming",
      "Delphi technique"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 211,
    "text": "In a functional organization, the director of an important stakeholder business group expressed concern to a line manager about the progress of the project. What should the line manager do next?",
    "options": [
      "Hold a face‑to‑face meeting with the project manager and warn them",
      "Point the director to a link where they can take a look at the reports",
      "Invite stakeholders to attend monthly progress review meetings",
      "Ask the project manager to update the monthly status report distribution list"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 212,
    "text": "What is the difference between quality metrics and quality measurements?",
    "options": [
      "Quality metrics are product attributes and the measurement is the result of the Monitor and Control Project process",
      "Quality metrics are the result of the Monitor and Control Project process and the measurements are product attributes",
      "Quality metrics and measurements are the same concept",
      "Quality metrics is the general objective and the measurements are the specific objectives"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 213,
    "text": "How can a project manager determine if the project activities comply with organizational and project policies, processes, and procedures?",
    "options": [
      "Look at the quality metrics",
      "Validate the scope",
      "Review the quality checklist",
      "Conduct a quality audit"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 214,
    "text": "What are the objectives of initiation processes?",
    "options": [
      "Initiation processes are performed in order to develop the project charter and identify stakeholders.",
      "Initiation processes are performed in order to obtain budget approval for a project or phase and approve scope with customers.",
      "Initiation processes are performed to identify business objectives for a project or phase and identify stakeholders' goals.",
      "Initiation processes are performed to map initial requirements for a project or phase and prioritize them with stakeholders."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 215,
    "text": "A project has an estimated duration of 10 months with a total budget of US$220,000. At the end of the fifth month, it is estimated that at completion the project will incur US$250,000. If the actual cost (AC) calculated is US$150,000, what is the earned value (EV) of the project?",
    "options": [
      "US$-30,000",
      "US$120,000",
      "US$370,000",
      "US$400,000"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 216,
    "text": "In agile projects while performing scope management, what is the definition of requirements?",
    "options": [
      "Metrics",
      "Sprint",
      "Charter",
      "Backlog"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 217,
    "text": "Which of the following sets are inputs to the Collect Requirements process?",
    "options": [
      "Project charter and requirements documentation",
      "Project charter and business documents",
      "Project charter and stakeholder requirements",
      "Business documents and requirements traceability matrix"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 218,
    "text": "During the execution phase of a project a defect is found. The project manager takes responsibility and with the correct documentation begins the task necessary to repair the defect. What process was applied?",
    "options": [
      "Change request",
      "Risk response",
      "Risk management plan",
      "Lessons learned"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 219,
    "text": "A project manager has just completed several brainstorming sessions and has gathered the data to show commonality and differences in one single place. What technique was followed?",
    "options": [
      "Collective decision making",
      "Multicriteria decision analysis",
      "Mind mapping",
      "Affinity diagram"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 220,
    "text": "Which components of the project management plan are inputs used when creating the stakeholder engagement plan?",
    "options": [
      "Risk, resource, and communications management plans",
      "Scope, quality, and resource management plans",
      "Procurement, integration, and risk management plans",
      "Communications, schedule, and cost management plans"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 221,
    "text": "Which contract type is least desirable to a vendor?",
    "options": [
      "Fixed price with economic price adjustment (FPEPA)",
      "Firm fixed price (FFP)",
      "Cost plus fixed fee (CPFF)",
      "Cost plus award fee (CPAF)"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 222,
    "text": "A project manager is addressing risks and potential concerns related to stakeholder management, and is clarifying and resolving previously identified issues. In which process is the project manager engaged?",
    "options": [
      "Identify Stakeholders",
      "Plan Stakeholder Engagement",
      "Manage Stakeholder Engagement",
      "Monitor Stakeholder Engagement"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 223,
    "text": "Deciding the phases of project life cycle would be considered a part of which of these knowledge areas?",
    "options": [
      "Project Schedule Management",
      "Project Scope Management",
      "Project Resource Management",
      "Project Integration Management"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 224,
    "text": "Responsible, accountable, consult and inform (RACI) is an example of which of the following?",
    "options": [
      "Text-oriented format",
      "Resource management plan",
      "Organization chart",
      "Responsibility assignment matrix (RAM)"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 225,
    "text": "What charts and figures should project managers use during the Perform Quantitative Risk Analysis process?",
    "options": [
      "Tornado diagrams and influence diagrams",
      "Detectability bubble charts and probability and impact matrix",
      "Hierarchical charts and burndown charts",
      "Flow charts and RACI charts"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 226,
    "text": "Recognition and rewards are tools and techniques of which process?",
    "options": [
      "Develop Team",
      "Manage Team",
      "Control Resources",
      "Plan Resource Management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 227,
    "text": "What are the key tools for managing project knowledge?",
    "options": [
      "Expert judgment and data gathering",
      "Networking and storytelling",
      "Data analysis and decision making",
      "Prototypes and product analysis"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 228,
    "text": "Make-or-buy analysis is a tool and technique of which process?",
    "options": [
      "Conduct Procurements",
      "Plan Procurement Management",
      "Analyze Procurements",
      "Control Procurements"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 229,
    "text": "Which of the following are outputs of the Define Scope process in Project Scope Management?",
    "options": [
      "Requirements documentation and requirements traceability matrix",
      "Scope management plan and requirements management plan",
      "Project scope statement and project documents updates",
      "Scope baseline and project documents updates"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 230,
    "text": "What does an S-curve from a Monte Carlo analysis show?",
    "options": [
      "Cumulative probability distribution representing probability of achieving a particular outcome",
      "Individual project risks or uncertainties that have the most potential impact on outcome",
      "Best alternative out of the possible solutions, incorporating associated risks and opportunities",
      "Diagram for all project uncertainties and their influence over a period of time"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 231,
    "text": "Project managers play a key role in performing integration on a project. What are the three different levels of integration?",
    "options": [
      "Process, cognitive, and context",
      "Complexity, understand, and change",
      "Interact, insight, and leadership",
      "Communication, knowledge, and value"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 232,
    "text": "Which of the following is an example of tacit knowledge?",
    "options": [
      "Risk register",
      "Project requirements",
      "Expert judgment",
      "Make-or-buy analysis"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 233,
    "text": "Which of the following technology platforms is most effective for sharing information when managing virtual project teams?",
    "options": [
      "Video conferencing",
      "Audio conferencing",
      "Shared portal",
      "Email/chat"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 234,
    "text": "When should Project Risk Management be conducted?",
    "options": [
      "Project Planning",
      "Monitoring and Controlling",
      "Quality Planning",
      "Throughout the project life cycle"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 235,
    "text": "One of the outputs of the project schedule is a detailed plan. What is the main purpose of that detailed plan?",
    "options": [
      "It represents how and when the project will deliver the products, services, and results defined in the project scope",
      "It creates a formal record of the project and shows the organizational commitment to the project",
      "It describes how the scope will be defined, developed, monitored, controlled, and validated",
      "It provides the needs of a stakeholders or stakeholder group"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 236,
    "text": "Which of the following are processes associated with Project Cost Management?",
    "options": [
      "Develop Costs, Estimate Costs, Determine Budget, Control Costs",
      "Develop Budget, Determine Budget, Determine Risks, Control Costs",
      "Plan Cost Management, Estimate Costs, Determine Budget, Control Costs",
      "Plan Budget Management, Determine Budget, Create Cost Accounts, Control Costs"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 237,
    "text": "A project manager is performing the procurement management process with three vendors. The project team is reviewing the requests for proposal (RFPs). What type of procurement document is the RFP?",
    "options": [
      "Bid document",
      "Statement of work (SOW)",
      "Source selection criteria",
      "Independent cost estimate"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 238,
    "text": "What is a key benefit of using virtual project teams?",
    "options": [
      "Ensures appropriate behavior, security, and the protection of proprietary information",
      "Reduces the risk of conflict due to interpersonal communications and other interactions",
      "Assures that all team members have a clear and common understanding of the project",
      "Reduces project cost by use of modern technologies allowing seamless team collaboration"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 239,
    "text": "Which behavior relates to team leadership?",
    "options": [
      "Centering on systems and structure",
      "Providing guidance using the power of relationships",
      "Accepting the status quo",
      "Focusing on operational issues and problem solving"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 240,
    "text": "For a 10‑day project, activity B’s duration is three days, and activity C’s duration is two days. What is the duration of activity A if activities B and C are performed in parallel?",
    "options": [
      "3 days",
      "5 days",
      "7 days",
      "10 days"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 241,
    "text": "What is the purpose of the Manage Quality process?",
    "options": [
      "To translate the quality management plan into executable quality activities",
      "To monitor and record the results of executed quality management activities",
      "To determine if project activities comply with organizational and project policies",
      "To identify project deliverables and quality requirements and/or standards"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 242,
    "text": "What method for categorizing stakeholders is suitable for small projects with simple relationships among stakeholders?",
    "options": [
      "Prioritization",
      "Directions of influence",
      "Salience model",
      "Power/influence grid"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 243,
    "text": "What process in Project Risk Management prioritizes project risks?",
    "options": [
      "Perform Qualitative Risk Analysis",
      "Perform Quantitative Risk Analysis",
      "Plan Risk Responses",
      "Implement Risk Responses"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 244,
    "text": "What process is performed periodically throughout the project as needed?",
    "options": [
      "Plan Risk Management",
      "Plan Communications Management",
      "Plan Resource Management",
      "Plan Cost Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 245,
    "text": "A project team is closing out a phase and updating the organizational knowledge base. What organizational process asset (OPA) will the team update?",
    "options": [
      "Traceability matrices",
      "Lessons learned",
      "Change control procedures",
      "Resource availability"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 246,
    "text": "What does the creation of a project management plan accomplish?",
    "options": [
      "Defines the basis of all project work and how it will be performed",
      "Acknowledges the existence of a project, and defines its high‑level information",
      "Authorizes the project manager to apply organizational resources to project activities",
      "Provides the project manager with organizational standards, policies, processes, and procedures"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 247,
    "text": "When planning communications management, what input identifies key stakeholders?",
    "options": [
      "Work performance information",
      "Project schedule",
      "Project charter",
      "Work performance reports"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 248,
    "text": "In an interactive communication model, how is the sender ensured that the message was understood by the receiver?",
    "options": [
      "The receiver decodes the message",
      "The receiver responds to the message with feedback",
      "The receiver transmits the message",
      "The receiver acknowledges their receipt of the message"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 249,
    "text": "A project manager proactively meets with other project managers who manage other projects in the same program. To minimize the impact that those projects may have on their project, of what should the project manager be aware?",
    "options": [
      "Demands on the same resources",
      "Requirements that impact the scope",
      "Uncertainty of emerging issues",
      "Project charter"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 250,
    "text": "Which role does the project manager resemble best?",
    "options": [
      "Orchestra conductor",
      "Facilities supervisor",
      "Functional manager",
      "School principal"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 251,
    "text": "Directing another person to get from one point to another using a known set of expected behaviors and the ability to lead a team and inspire them to do their jobs well is related to?",
    "options": [
      "Influence and challenge",
      "Innovation and administration",
      "Leadership and management",
      "Engagement and guidance"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 252,
    "text": "What purpose does the hierarchical focus of stakeholder communications serve?",
    "options": [
      "Maintains the focus on project and organizational stakeholders",
      "Preserves the focus on external stakeholders — such as customers and vendors — as well as on other projects",
      "Sustains the focus on general communication activities using email, social media, and websites",
      "Keeps the focus on the position of the stakeholder or group with respect to the project team"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 253,
    "text": "A project team of telecommuters located in three different time zones regularly misses project deadlines. Daily meetings often start and end with the same person talking and the rest of the team listening. The project manager determines that communication among team members must be addressed.",
    "options": [
      "Interpersonal communication",
      "Feedback/response communication",
      "Push communication",
      "Pull communication"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 254,
    "text": "How does planning for prevention costs assist in meeting stakeholder needs and expectations, while still providing required performance and reliability?",
    "options": [
      "It details product or service failures experienced by the customer",
      "It clarifies the costs associated with assessing the quality of the product or service",
      "It accounts for costs used to avoid poor quality in the product or service",
      "It communicates product or service failures discovered by the project team"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 255,
    "text": "What organizational process asset (OPA) can impact a project?",
    "options": [
      "Marketplace conditions",
      "Preapproved supplier lists",
      "Physical environmental elements",
      "Legal restrictions"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 256,
    "text": "What earned value (EV) measure indicates the cost efficiency of the work completed?",
    "options": [
      "Cost variance (CV)",
      "Cost performance index (CPI)",
      "To‑complete performance index (TCPI)",
      "Variance at completion (VAC)"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 257,
    "text": "Product requirements specify a functionality that depends upon expertise that is unavailable internally. What process should be implemented to generate a make‑or‑buy decision?",
    "options": [
      "Conduct Procurements",
      "Plan Procurement Management",
      "Plan Risk Responses",
      "Plan Risk Management"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 258,
    "text": "What important qualities should project managers possess for strategic and business management?",
    "options": [
      "Skills and behaviors related to specific domains of project management",
      "Knowledge and competencies needed to guide and motivate a team",
      "Skills and behaviors needed to help an organization achieve its goals",
      "Expertise in the industry and organization that deliver better outcomes"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 259,
    "text": "What can increase the complexity of the Manage Stakeholder Engagement process?",
    "options": [
      "The project must be of high quality.",
      "The stakeholders are from different countries.",
      "The project must comply with strict local government regulations.",
      "The project has a tight budget and timeline."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 260,
    "text": "Which of the following set of items belongs to the communications management plan?",
    "options": [
      "Escalation processes and meeting management",
      "Project schedule and glossary of common terminology",
      "Escalation processes and stakeholder communication requirements",
      "Interactive communication model and information to be communicated"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 261,
    "text": "Which of the following is an output of the Perform Integrated Change Control process?",
    "options": [
      "Cost‑benefit analysis",
      "Updated project charter",
      "Approved change request",
      "Multicriteria decision analysis"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 262,
    "text": "What is the recommended approach for handling risk in a high‑variability environment?",
    "options": [
      "Adaptive",
      "Predictive",
      "Iterative",
      "Incremental"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 263,
    "text": "A project manager is creating a project charter to provide a direct link between the project and the organization’s strategic objectives. What must be considered when creating this document?",
    "options": [
      "High‑level requirements and the project team",
      "Key stakeholder list and contingency reserve",
      "Detailed milestone schedule and project objectives",
      "Project purpose and high‑level project description"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 264,
    "text": "If a project manager effectively manages project knowledge, a key benefit is that:",
    "options": [
      "all stakeholders have access to the same information.",
      "the project team is able to understand the project status.",
      "project stakeholders have a clear picture of the project.",
      "new knowledge is added to organizational process assets."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 265,
    "text": "What process in Project Schedule Management identifies and documents specific actions to be performed to produce a project’s deliverables?",
    "options": [
      "Plan Schedule Management",
      "Define Activities",
      "Develop Schedule",
      "Estimate Activity Durations"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 266,
    "text": "A project manager is working on project cost management. The following information is current: Planned value = 30; Actual cost = 35; Earned value = 28. Considering this data, which project indicator is correct?",
    "options": [
      "Schedule Variance (SV) = 2",
      "Cost Performance Index (CPI) = 0.80",
      "Schedule Performance Index (SPI) = 1.93",
      "Cost Variance (CV) = 7"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 267,
    "text": "When project requirements are documented in user stories then prioritized and refined just prior to construction, which approach is being used for scheduling?",
    "options": [
      "Iterative scheduling with backlog",
      "On‑demand scheduling",
      "Life cycle scheduling with backlog",
      "Defining iterative activities"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 268,
    "text": "The project manager released a report. A few stakeholders express the view that the report should not have been directed to them. Which of the 5 Cs of written communications does the project manager need to address?",
    "options": [
      "Correct grammar and spelling",
      "Concise expression and elimination of excess words",
      "Clear purpose and expression directed to the needs of the reader",
      "Coherent logical flow of ideas"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 269,
    "text": "What tool or technique is used in the Collect Requirements process?",
    "options": [
      "Inspection",
      "Decomposition",
      "Product analysis",
      "Prototypes"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 270,
    "text": "What tools or techniques are necessary to create the project management plan?",
    "options": [
      "Meetings and data analysis",
      "Expert judgment and data gathering",
      "Interpersonal skills and change control",
      "Data analysis and expert judgment"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 271,
    "text": "Due to organizational changes, a new product owner joins a project. The product owner wants to review the process used to obtain team members, facilities, equipment, materials, supplies, and other resources necessary to complete project work. What process should the project manager review with the product owner?",
    "options": [
      "Acquire Resources",
      "Plan Resource Management",
      "Estimate Activity Resources",
      "Control Resources"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 272,
    "text": "Which tool should a project manager consider to deal with multiple sources of risk?",
    "options": [
      "An updated risk register",
      "Risk breakdown structure",
      "Issue log",
      "Stakeholder register"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 273,
    "text": "What is a characteristic of the relationship among projects, programs, and portfolios?",
    "options": [
      "A portfolio is a group of programs, and a program is a large project.",
      "Portfolios often engage with the same stakeholders as the programs and projects in the portfolio.",
      "Programs focus on the internal interdependencies within each project in a portfolio.",
      "Portfolios focus on program results and project deliveries."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 274,
    "text": "An organization’s project management office (PMO) has issued guidelines that require a specific template to be used for onboarding resources for a project. Where can the project manager find this template?",
    "options": [
      "Resources management plan",
      "Organizational systems access",
      "Organizational process assets",
      "Procurement management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 275,
    "text": "An adaptive project manager is handling a five‑sprint cycle to deliver a minimum viable product (MVP). After the third sprint, the productivity of the team drops to 30 % due to a change in the way the team operates. Which of the following changes has caused this loss in productivity?",
    "options": [
      "The team picked up technical debt items in the third sprint as technical debt can only be picked up after completing two sprints.",
      "Two of the team members have been working in silos using different methods to validate their performance.",
      "Two of the team members were asked to do multitasking, which they did not do in the previous two sprints.",
      "The team velocity was measured in the third sprint since the tool to measure velocity was introduced only in the third sprint."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 276,
    "text": "In one of the project meetings during a project execution, a new stakeholder attends and highlights a new risk. What should the project manager do next?",
    "options": [
      "Make sure proper testing gets completed to minimize the risk highlighted.",
      "Add the stakeholder to the stakeholder register and add the risk to the risk register.",
      "Ignore the risk from this stakeholder as this stakeholder never showed up at the start of the project.",
      "Add this risk to the lessons learned register on project completion."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 277,
    "text": "A business analyst sent multiple meeting requests via instant message to a subject matter expert (SME) working in another country but did not receive a response. What should the business analyst do to reduce the likelihood of this occurring in the future with other stakeholders distributed across multiple locations?",
    "options": [
      "Check with the IT department to see if there is a technical issue.",
      "Confirm the time zone and work days in each location.",
      "Assume the meeting request is accepted unless declined.",
      "Ask each stakeholder for their preferred communication method."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 278,
    "text": "At the end of the third iteration, the project team gathers to discuss the stories to be implemented in the next iteration. What should the team do during this session?",
    "options": [
      "Develop a user story analysis based on the work done, depicting the current status, S‑curve, schedule variance (SV), and planned value (PV).",
      "Run a spike to ensure all information available is correct and then decide which stories to implement.",
      "Bring up all risks for implementing the user stories and discuss possible solutions.",
      "Plan the backlog by estimating and reprioritizing the user stories as new information becomes available."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 279,
    "text": "A few project team members are having issues understanding the requirements as described. Which action should be taken to resolve this issue?",
    "options": [
      "Review the requirements traceability matrix, the business analysis communications management plan, and set up a meeting with the business analyst and key stakeholders.",
      "Review the requirements traceability matrix and set up a meeting with the business analyst and key stakeholders.",
      "Review the project management plan and set up a meeting with the project manager and key stakeholders.",
      "Review the business analysis communications management plan and set up a meeting with the business analyst and key stakeholders."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 280,
    "text": "During the requirements verification process, stakeholders are finding many errors in the requirements definition. What could the business analyst have done to avoid these errors?",
    "options": [
      "Asked the stakeholders to write the requirements themselves.",
      "Updated the requirements traceability matrix.",
      "Included the project manager in the elicitation sessions.",
      "Confirmed the elicitation results after sessions."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 281,
    "text": "A business analyst needs to ensure the project team understands the most critical roles and responsibilities within the requirements change process. Which responsibility is the most important?",
    "options": [
      "Approving the change",
      "Discussing the change",
      "Reviewing the change",
      "Analyzing the change"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 282,
    "text": "During a project team meeting, one of the team members suggested a product functionality that would immensely benefit the customer. The project manager documents the request for later analysis. What is this an example of?",
    "options": [
      "Managing the cost benefit",
      "Maintaining the product backlog",
      "Monitoring the traceability matrix",
      "Managing the scope"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 283,
    "text": "A project team is working on relocating offices to another building and providing new furniture. The new furniture was purchased from an international vendor. The price was negotiated in a foreign currency, and due to changes in the exchange rate, the cost has increased by 10 %. There is no contingency in the project budget. What should the project manager do?",
    "options": [
      "Escalate this issue to the procurement team.",
      "Escalate this issue to the project sponsor.",
      "Escalate this issue to the chief financial officer (CFO).",
      "Escalate this issue to the project management office (PMO)."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 284,
    "text": "A project manager is assigned to a new project with a defined scope. The project requires advanced planning at the start of the project. Which approach should the project manager select for the project?",
    "options": [
      "Adaptive",
      "Predictive",
      "Hybrid",
      "Kanban"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 285,
    "text": "A project team working on an automobile manufacturing project is detailing the parts needed for a car door design. The door is composed of several parts that have to be developed in sequence, as the frame is needed before other parts can be designed and built. What activity is the team involved in?",
    "options": [
      "Developing a stakeholder engagement plan",
      "Developing a communications management plan",
      "Creating a work breakdown structure (WBS)",
      "Identifying risks and issues in the project"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 286,
    "text": "A project team is working on a complex product and the work breakdown structure (WBS) is finalized. The team determines that the best approach is to use an adaptive delivery method and is now tasked with converting the WBS for adaptive delivery. How can the team manage the conversion of the existing WBS to an adaptive approach?",
    "options": [
      "Generate use cases for each WBS element and prepare a requirements document.",
      "Create themes for each WBS element and organize them into iterations for delivery.",
      "Organize the WBS into a set of related themes, epics, and user stories.",
      "Produce a release plan for each WBS element and organize them into iterations for delivery."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 287,
    "text": "An adaptive project team is grooming the backlog for the next iteration. What does the team need to document in the user stories to determine the work needed to complete each story?",
    "options": [
      "Team velocity in past iterations",
      "Related epics of each story",
      "Detailed acceptance criteria",
      "Product owner’s priorities"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 288,
    "text": "A project manager engages a highly specialized resource who is in a different location and cannot join the regular team meetings. This is leading to delays in productivity. How can the project manager assist the team to resolve the issue?",
    "options": [
      "Request the new resource be relocated with the rest of the team and document a change request for the project.",
      "Ask the team to identify possible options to resolve the issue with minimal impact to the new resource.",
      "Log this issue in the issue log and escalate it to the management team, asking them to replace the new team member.",
      "Consult the communications management plan to review available options, such as special virtual meetings, with the new resource."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 289,
    "text": "Which method should be used to elicit a cross‑functional requirement?",
    "options": [
      "Focus groups",
      "Prototyping",
      "Interviews",
      "Facilitated workshops"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 290,
    "text": "A project manager is working with the project sponsor to identify the resources required for the project. They use a RACI chart to ensure that the team members know their roles and responsibilities. What are the four elements of a RACI chart?",
    "options": [
      "Recommend, approve, coordinate, and inform",
      "Recommend, accountable, consult, and inform",
      "Responsible, accountable, consult, and inform",
      "Responsible, accountable, coordinate, and inform"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 291,
    "text": "A project manager is responsible for delivering new software for their company. Based on previous experiences, the project manager decides to use the dynamic systems development method (DSDM). The project manager will use this method to prioritize the scope to meet project constraints. Which elements are included in the DSDM framework?",
    "options": [
      "Cost, requirements, schedule, and outputs",
      "Schedule, risk, integration, and features",
      "Cost, time, quality, and functionality",
      "Time, integration, cost, and deliverables"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 292,
    "text": "Recently, the government published a new tax law giving companies one year to implement the changes. A project was initiated to change the accounting system. Which delivery approach is most suitable in this context?",
    "options": [
      "Predictive, because the requirements are clearly defined up‑front.",
      "Adaptive, because the changes have never been implemented before.",
      "Predictive, because of the high risk that the company can be fined.",
      "Adaptive, because the government will provide constant feedback."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 293,
    "text": "A project sponsor has asked the project manager to determine how soon the project can be completed. Which of the following methods can a project manager use to find this information?",
    "options": [
      "Decomposition",
      "Work breakdown structure (WBS)",
      "Critical path method (CPM)",
      "Scope baseline"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 294,
    "text": "A key stakeholder has left the project management team. The team now has a new key stakeholder who is requesting project reports from team members out of sequence. What should the project manager do first?",
    "options": [
      "Allow team members to share project status reports.",
      "Engage with the new stakeholder.",
      "Extend an iteration review invite to the new stakeholder.",
      "Perform qualitative risk analysis."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 295,
    "text": "Following a project planning meeting with the team, a few team members approach the project manager to follow up on actions required. How can the project manager assess the effectiveness of the meeting?",
    "options": [
      "Consult the communications management plan to determine the success criteria for meetings.",
      "Review the actions from the meeting with each of the project team members to ensure their understanding.",
      "Send the meeting minutes to all team members to verify that the required information is readily available.",
      "Ask the team members to provide feedback for meetings in the phase retrospective."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 296,
    "text": "An employee was hired to work on ongoing, repetitive activities in the accounting department. The employee’s duties are managing and controlling day‑to‑day activities. Which type of managing is the employee performing?",
    "options": [
      "Strategic",
      "Finance",
      "Operations",
      "Project"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 297,
    "text": "A team is feeling pressured to begin development work due to tight project deadlines. There are stakeholders with similar functions located in multiple countries. To accelerate the process, the business analyst has limited the requirements elicitation sessions to times that work for stakeholders in one time zone. To reduce the risk with this approach, which step should the business analyst take?",
    "options": [
      "Request the project sponsor to approve this requirements elicitation approach for this project.",
      "Ask the stakeholders in the elicitation sessions to speak on behalf of stakeholders in other time zones.",
      "Distribute the documented requirements to relevant stakeholders in all time zones for review and comment.",
      "Add the risk to the risk register so other stakeholders are aware of the approach."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 298,
    "text": "During the project life cycle for a major product, a stakeholder asked to add a new feature. Which document should they consult for guidance?",
    "options": [
      "Product release plan",
      "Project management plan",
      "Project release plan",
      "Product management plan"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 299,
    "text": "A project manager read the initial contract when a project was started. The contract states a house has to be built in one year, and the foundation has to be completed in 30 days. What should the project manager do?",
    "options": [
      "Start the project as soon as possible, as time is short.",
      "Add the milestones to the risk register, as time is short.",
      "Add the two milestones to the project plan, as they are mandatory.",
      "Calculate the duration of the two milestones stated in the contract."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 300,
    "text": "A project manager is managing a small project that has a time constraint. What should the project manager do to ensure the delivery is on time?",
    "options": [
      "Increase quality review cycles.",
      "Schedule the tasks in sequence.",
      "Schedule the tasks in parallel.",
      "Expand the scope of the project."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 301,
    "text": "During a retrospective, the team finds that all of the user stories are not complete. What should be done with the incomplete user stories?",
    "options": [
      "Advance these user stories to the top of the next sprint backlog.",
      "Remove these user stories as they are not important.",
      "Move these user stories back to the product backlog for reprioritization.",
      "Complete these user stories in the current sprint and extend the sprint length."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 302,
    "text": "A Scrum team has a product backlog and a sprint backlog. Which of the following is a correct statement related to these artifacts?",
    "options": [
      "The sprint backlog contains items to be completed during the current sprint.",
      "The sprint backlog contains the list of items prioritized by the product owner.",
      "The product backlog does not contain a prioritized list of requirements.",
      "The product backlog is a subset of the sprint backlog."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 303,
    "text": "A project team is tasked with decomposing the scope to enable detailed cost and duration estimates. What should the team do to achieve this requirement?",
    "options": [
      "Prepare a WBS for immediate tasks in the plan to work package level for duration and cost estimates.",
      "Prepare a work breakdown structure (WBS) to include each deliverable with a target duration and cost estimate.",
      "Prepare a WBS with task sequencing and detail the duration and cost estimates.",
      "Prepare a WBS to work package level to effectively manage duration and cost estimates."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 304,
    "text": "An adaptive team schedules 20 story points in the upcoming sprint. Historically, the team completes 25 story points on average per sprint. Each sprint is two weeks, and there is one day of float. What is the likelihood the team will complete all 20 story points in the upcoming sprint?",
    "options": [
      "50‑75 %",
      "25‑50 %",
      "75‑100 %",
      "0‑25 %"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 305,
    "text": "What can a requirements traceability matrix enable regardless of the project methodology being used?",
    "options": [
      "Creation of a solid business case",
      "Investigation of the viability of a new product",
      "Evaluation of solution and system performance",
      "Identification of missing and superfluous requirements"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 306,
    "text": "A project team is meeting to seek solutions on a new problem that occurred recently. The meeting is comprised of two parts: the first is a generation of ideas and the second is an analysis. Which technique is the team using?",
    "options": [
      "Interview",
      "Checklists",
      "Brainstorming",
      "Focus group"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 307,
    "text": "Based on a previous project that has been completed, a project manager decides the best way to estimate costs is through historical data. What kind of estimating is this?",
    "options": [
      "Bottom‑up",
      "Three‑point",
      "Parametric",
      "Analogous"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 308,
    "text": "A dynamic systems development method (DSDM) practitioner receives a new high‑priority feature request. What should the practitioner do first?",
    "options": [
      "Develop the feature as a parallel work package.",
      "Shorten the current work period and begin the new work.",
      "Prioritize it in the requirements list for the next work period.",
      "Ask a dedicated team member complete it immediately."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 309,
    "text": "In a demonstration meeting with a customer, the project team presented deliverables that were considered ready for customer use. The team based the results on a checklist of all the required criteria for the project. Which of the following elements is the team using?",
    "options": [
      "Definition of done (DoD)",
      "Burndown chart",
      "Definition of ready (DoR)",
      "Backlog refinement"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 310,
    "text": "Which project life cycle follows a plan reviewed and approved by the stakeholders?",
    "options": [
      "Adaptive",
      "Iterative",
      "Incremental",
      "Predictive"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 311,
    "text": "Which tool should a project manager use to calculate cost variance for a project?",
    "options": [
      "Contingency analysis",
      "Expert judgment",
      "Actual cost",
      "Review lessons learned from similar projects"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 312,
    "text": "A business analyst has encountered a conflict related to competing requirements on an existing project. What tool should the business analyst use to resolve this issue?",
    "options": [
      "Peer review",
      "Risk assessment",
      "Weighted ranking",
      "Procurement management"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 313,
    "text": "A business manager wants to start a project to launch a new product and submits a business case to the Portfolio Steering Committee for review. The committee asks the manager for details about the expected business value of the project. How can the manager document the business value for the Portfolio Steering Committee?",
    "options": [
      "Create a presentation outlining the business benefits of the new product.",
      "Execute a market study for similar products and demonstrate a market need.",
      "Conduct a feasibility study to determine the business impact of the new product.",
      "Prepare a benefits management plan to capture target benefits and strategic alignment."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 314,
    "text": "A new project manager is assigned to a high‑visibility project. The project manager starts with the requirements analysis process. Who should the project manager onboard to assist with the requirements traceability matrix or analysis?",
    "options": [
      "Technical consultant",
      "Project sponsor",
      "Business analyst",
      "Systems analyst"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 315,
    "text": "During a sprint demo, the customer says that one of the user stories is not ready for customer use. Which checklist should the team look at to find out what has been missed for the user story?",
    "options": [
      "Definition of done (DoD)",
      "Burndown chart",
      "Velocity chart",
      "Definition of ready (DoR)"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 316,
    "text": "The handoff of the first version of a software application to the operational team has taken a month longer than anticipated. How could this extended transition time have been avoided?",
    "options": [
      "If the transition process was agreed upon during the build",
      "If the end‑user documentation was more thorough",
      "If the operation team members were trained externally",
      "If the operations manager was invited to all sprint reviews"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 317,
    "text": "Which of the following is part of the project sponsor's responsibility?",
    "options": [
      "Tracking the business value",
      "Auditing the business value",
      "Monitoring the business value",
      "Advocating the business value"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 318,
    "text": "A project manager has joined the sponsor to verify the last deliverable of the project. The sponsor is measuring and examining the deliverable to determine whether it meets the requirements and product acceptance criteria. Which activity is being performed?",
    "options": [
      "Brainstorming",
      "Prototyping",
      "Decision making",
      "Inspection"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 319,
    "text": "A project manager is reporting the project performance as 25 days worth of work completed against 13 days originally planned. What is the schedule variance (SV)?",
    "options": [
      "1.15",
      "12",
      "‑12",
      "38"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 320,
    "text": "A technical project manager uses a directive approach with the team. Some team members are growing increasingly frustrated when their recommendations are not adopted by the project manager. What should the project manager do to address this issue?",
    "options": [
      "Apply emotional intelligence (EI) skills, such as active listening, to understand the team's issues.",
      "Ask the team members to record their concerns in the lessons learned log for future action.",
      "Instruct the team members to self‑organize and resolve any outstanding issues.",
      "Encourage the team to follow the project plan that was developed with team input."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 321,
    "text": "A key project team member complains about being left out of the communication loop. In order to ensure that each key member is involved, who should review the business analysis communications management plan?",
    "options": [
      "Business analyst, project manager, and stakeholders",
      "Business analyst, project manager, and sponsor",
      "Business analyst and project manager",
      "Only the business analyst"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 322,
    "text": "A community project with a large number of stakeholders is scheduled for delivery in six months. The project manager asked the business analyst to ensure an effective requirements elicitation. What should the business analyst do?",
    "options": [
      "Engage a consult ant that is familiar with the community needs.",
      "Organize a workshop with the sponsor and major stakeholders.",
      "Ask the project coordinator to facilitate some of the workshops.",
      "Invite both internal and external stakeholders to the workshops."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 323,
    "text": "An organization is faced with increasing demand from the board of directors. They say budgets are flexible as long as the work gets completed. What project management approach should the organization use?",
    "options": [
      "Predictive",
      "Iterative",
      "Adaptive",
      "Hybrid"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 324,
    "text": "A project manager is seeking assistance from the business analyst for an IT project. What assistance can the business analyst provide?",
    "options": [
      "Elicit product requirements.",
      "Manage the project schedule.",
      "Allocate project resources.",
      "Verify product functionality."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 325,
    "text": "A project manager has the task of determining the deliverables for a six‑month project using a predictive approach. How should the project manager determine which processes to include in the project management plan?",
    "options": [
      "Identify the processes and deliverables for only the current phase first.",
      "Discuss the processes and deliverables needed to meet the project objectives with the team.",
      "Integrate hybrid approach processes and deliverables to meet the short delivery time line.",
      "Follow organizational methodology and produce all required deliverables."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 326,
    "text": "During project planning, team members seemed clear on deliverables; however, once execution progressed they asked for smaller components to understand what must be delivered. What should the project manager do?",
    "options": [
      "Schedule additional meetings with the customer to explain the requirements for each deliverable at length.",
      "Share the project management plan with the team members again to bring them up to speed on the requirements.",
      "Revisit the work breakdown structure (WBS) again during execution, as the WBS can be defined at different points in the project.",
      "Inform the stakeholders that the stakeholder register needs to be recreated, as the team does not understand the requirements."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 327,
    "text": "A project team is brainstorming about the best methods and practices to adopt for an upcoming project. What is the project team trying to follow?",
    "options": [
      "Programs",
      "Portfolios",
      "Standards",
      "Concepts"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 328,
    "text": "Which tool uses an algorithm based on historical data to calculate cost?",
    "options": [
      "Parametric estimating",
      "Relative estimating",
      "Three‑point estimating",
      "Analogous estimating"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 329,
    "text": "On a clinical trial project, the project manager is worried about maintaining control of the project and decides to use a requirements traceability matrix. What is the advantage of using this tool?",
    "options": [
      "Scope creep will be prevented.",
      "Resource allocation will be kept to a minimum.",
      "Project costs will be controlled.",
      "Project closure will be established."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 330,
    "text": "A project manager is newly assigned to a project. Which document can help the project manager understand the project scope?",
    "options": [
      "Context diagram",
      "Process flow diagram",
      "User interface now",
      "Data flow diagram"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 331,
    "text": "A new project was approved by the project management office (PMO) to build a detachable classroom. What delivery method and artifacts should the project manager use to deliver this project?",
    "options": [
      "Adaptive project management; project schedule and project backlog",
      "Linear project management; project schedule and project backlog",
      "Linear project management; project schedule and work breakdown structure (WBS)",
      "Adaptive project management; project schedule and work breakdown structure"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 332,
    "text": "Which of the following does a portfolio combine?",
    "options": [
      "Projects, programs, and risks",
      "Operations, strategies, and business continuity",
      "Projects, programs, and operations",
      "Projects, change management, and operations"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 333,
    "text": "A new team member close to an influential stakeholder is channeling requests for multiple reports through themselves and has asked the project manager for guidance. What should the project manager do first?",
    "options": [
      "Update the communications management plan.",
      "Manage stakeholder engagement.",
      "Consult the communications management plan.",
      "Forward the status reports to the stakeholder."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 334,
    "text": "All testing on a project has been performed successfully and all acceptance criteria have been met. What is the next step?",
    "options": [
      "Deliver the product.",
      "Set up a go/no‑go meeting.",
      "Set up a meeting with the sponsor.",
      "Wait for the next sprint."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 335,
    "text": "How does a requirements traceability matrix help to determine whether a product is ready for delivery?",
    "options": [
      "It confirms the completion of all stories in the backlog.",
      "It tracks links between the approved requirements and each work product.",
      "It assesses the quality of test cases and expected results.",
      "It captures assigned tasks and their estimated durations."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 336,
    "text": "A project is in its final stages when a competitor releases a similar product, potentially making the project redundant. What should the project manager do next?",
    "options": [
      "Initiate change control.",
      "Address risk mitigation.",
      "Initiate project closure.",
      "Escalate this to the project sponsor."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 337,
    "text": "Construction has stopped because a supplier failed to deliver concrete, putting the schedule three months behind. What should the project manager do to put the project back on track?",
    "options": [
      "Follow the risk response plan and allocate resources, if needed, to overcome the issue.",
      "Accept any penalties and continue as initially planned.",
      "Consult the legal department and subject‑matter experts to avoid failure.",
      "Extend the delivery time and use management reserve to cover losses."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 338,
    "text": "How can working in iterations increase the quality of the product being built?",
    "options": [
      "The project manager has more time to document goals in advance.",
      "Requirements are frequently clarified by users of the product.",
      "Teams have to do less planning and focus more on quality.",
      "Less testing is required since it is done at the end of the project."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 339,
    "text": "A project’s earned value (EV) is lower than its actual cost (AC). How should the project manager report the status?",
    "options": [
      "The project is tracking well as the cost variance (CV) is negative.",
      "The project is within budget but is delayed.",
      "The project is within budget and within schedule.",
      "The project is at risk as the cost variance (CV) is negative."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 340,
    "text": "A project team is evaluating criteria to decide whether to start a project. Which activity will provide insight into a go/no‑go decision?",
    "options": [
      "Cost of quality (COQ)",
      "Cost‑benefit analysis",
      "Benchmarking",
      "Lessons learned"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 341,
    "text": "A global company adopting an adaptive approach faces time‑zone issues and schedule slippage. Which tools should the teams use to collaborate effectively?",
    "options": [
      "Benchmark and adopt competitors’ best practices.",
      "Use only collocated development teams.",
      "Adopt an iterative development approach and conduct virtual meetings.",
      "Arrange frequent collocated meetings so teams work together."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 342,
    "text": "A quality management plan describes how project and product scopes are managed in accordance with which of the following?",
    "options": [
      "Historical quality standards and past organizational projects",
      "Product sponsor’s expectation of organizational quality",
      "Organizational quality policies, standards, and methodologies",
      "Organizational quality policies, stakeholder expectations, and historical data"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 343,
    "text": "A team using an adaptive approach is delayed by one month due to an unforeseen risk. What should the team do next to deliver the project?",
    "options": [
      "Reprioritize the work based on the increased visibility of current risks.",
      "Accept the delay and add the risk to lessons learned.",
      "Stop work entirely until the risk is mitigated.",
      "Change the delivery date and deliver the original scope after mitigation."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 344,
    "text": "A project manager was assigned to a project to implement a manufacturing system in a food factory. The main project objective is to deliver machines that are ready to process food. The project manager decides that this particular project does not require the use of time‑boxed iterations. Which method should the project manager adopt?",
    "options": [
      "Scrum",
      "SAFe",
      "Feature‑driven development (FDD)",
      "Kanban"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 345,
    "text": "A subject‑matter expert (SME) was recently assigned to a project to manage a new compliance requirement. The SME claims that the activity prioritization must change and the schedule can be shortened to meet the new need. How should the project manager proceed?",
    "options": [
      "Perform Integrated Change Control.",
      "Update the schedule to include compliance.",
      "Manage Stakeholder Engagement.",
      "Conduct a risk assessment with the team."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 346,
    "text": "A project veers off track due to scope creep, and the project management team requests an immediate response from major stakeholders. What should the project manager do next to avoid project failure?",
    "options": [
      "Request a meeting with top management to state concerns about their ability to handle the situation.",
      "Develop a focus group to face the issue and decide on the appropriate direction.",
      "Adopt a change‑management approach and delay the project to decide on the direction.",
      "Delay the project by adopting a fast‑fail approach, mitigating the risk of a bigger impact on the company."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 347,
    "text": "An adaptive team is merging a legacy system from an acquired company. To check status and manage flow, they are using a scrum board. What data should be included in this information radiator?",
    "options": [
      "Key performance indicators (KPIs) and baseline",
      "Product and sprint backlog",
      "Burndown and burn‑up charts",
      "Increments and bottlenecks"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 348,
    "text": "Given: Early Start (ES) = 16 weeks; Actual Time = 12 weeks; Schedule Performance Index (SPI) = 1.3. What is the schedule variance (SV) for this project?",
    "options": [
      "5",
      "2",
      "3",
      "4"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 349,
    "text": "What is the equation to calculate cost variance (CV)?",
    "options": [
      "CV = EV / AC",
      "CV = EV / BAC",
      "CV = EV − BAC",
      "CV = EV − AC"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 350,
    "text": "Which of the following activities are included as part of a project manager’s responsibilities?",
    "options": [
      "Direct, control, and focus on structure.",
      "Inspire, engage, and build relationships with people.",
      "Control, maintain project status, and develop.",
      "Problem‑solve, achieve the bottom line, and focus on success."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 351,
    "text": "An agile team preparing an information‑system project creates a checklist for user‑centric requirements needed to begin work. Which checklist does the team produce?",
    "options": [
      "Definition of done (DoD)",
      "Definition of ready (DoR)",
      "Product backlog",
      "Sprint backlog"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 352,
    "text": "A small game studio needs three versions of a game, each in five one‑month iterations, to achieve early ROI. Which methodology should the project manager adopt?",
    "options": [
      "Scrum using sprints and retrospectives to maximize delivery and value",
      "Feature‑driven development (FDD) with milestones controlled by the dev manager",
      "Extreme Programming (XP) with paired development for faster delivery",
      "Kanban for team flexibility within the given time frame"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 353,
    "text": "A project manager wants to evaluate solution results in a wider context to ensure acceptable behavior in production. Which evaluation technique should be used?",
    "options": [
      "Exploratory testing",
      "Day‑in‑the‑life testing",
      "Integration testing",
      "Performance testing"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 354,
    "text": "Which option is an external enterprise environmental factor (EEF)?",
    "options": [
      "Location of virtual teams",
      "Software used by an organization",
      "Data‑protection regulation for a country",
      "Feedback received on a new product"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 355,
    "text": "While onboarding resources, which part of the project management plan will the project manager update?",
    "options": [
      "Resource management plan and cost baseline",
      "Resource management plan and lessons‑learned register",
      "Resource management plan and procurement management plan",
      "Resource management plan and preassignment"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 356,
    "text": "A monthly status report must compare performance to the baseline schedule. How is schedule variance (SV) on the critical path calculated?",
    "options": [
      "Earned Schedule ÷ Actual Time",
      "Actual Time − Earned Schedule",
      "Earned Value − Planned Value",
      "Planned Value − Earned Value"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 357,
    "text": "After final deliverables are approved on schedule, the client requests an additional feature. What documentation should the product owner already have?",
    "options": [
      "Lessons learned",
      "Project management plan",
      "Sign‑off",
      "Scope definition"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 358,
    "text": "With a finalized schedule baseline, how can the critical path be identified?",
    "options": [
      "Find the path with leveled resources and the shortest duration.",
      "Identify tasks with float that do not affect project duration.",
      "Use the crashed schedule to find the absolute shortest duration.",
      "Identify the longest activity path with the shortest possible duration."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 359,
    "text": "An adaptive project manager must staff a top‑priority website migration by reallocating team members from other projects. How should the manager assign these members?",
    "options": [
      "Full allocation",
      "Task switching",
      "Prediction",
      "Multitasking"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 360,
    "text": "After a sprint review, users like the demonstrated functionality, but another sprint item is not ready for production. What should the project team do?",
    "options": [
      "Demo the incomplete feature at the sprint retrospective.",
      "Deploy only the functionality presented to the users.",
      "Continue sprinting until the backlog is empty.",
      "Wait until all in‑development stories are complete."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 361,
    "text": "A project team for a marketing company is acquiring leaflets and materials from competitors. The team is working on a project to release new products, and they are trying to get ideas on how to most efficiently market these new products.",
    "options": [
      "Brainstorming",
      "Benchmarking",
      "Project initiation",
      "Project execution"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 362,
    "text": "What are the requirements that describe the behaviors of a product called?",
    "options": [
      "Functional requirements",
      "Nonfunctional requirements",
      "Solution requirements",
      "Transition requirements"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 363,
    "text": "Which of the following is a goal of the project charter?",
    "options": [
      "Detail requirements for the project tasks.",
      "List all tasks the team should perform in the project.",
      "Empower the project manager to manage the project.",
      "Develop a business case to support the project."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 364,
    "text": "An adaptive team is working on a mobile banking application. The team conducted their sprint demo, which included twelve stories that were completed. This was the last sprint before the product was to be launched in the beta phase. One attendee noticed that a requested enhancement to share on social media was still in the product backlog. Why was the product still determined to be ready for delivery?",
    "options": [
      "The development team completed all of the stories identified by the product owner as having the highest customer value.",
      "The development team ran out of time and did not pull the social‑media story from the backlog.",
      "The sprint demo went smoothly and the team did not find any open issues.",
      "The social‑media story is a marketing priority and less important than other priorities."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 365,
    "text": "An executive sponsor wants to be briefed on how the product will change over time. Which document should the business analyst use to prepare their presentation?",
    "options": [
      "Project charter",
      "Project management plan",
      "Product roadmap",
      "Product requirement"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 366,
    "text": "When executing a project, a newly hired subject‑matter expert (SME) remarks that the schedule could be crashed and was not assessed properly. What should the project manager do next?",
    "options": [
      "Update the schedule baseline.",
      "Update the risk register.",
      "Review the schedule baseline.",
      "Initiate a change request."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 367,
    "text": "A project team member is discussing a new project with their manager. The project is very similar to a project delivered last year and the scope is very well documented. Which of the following project‑delivery approaches should be recommended?",
    "options": [
      "Adaptive",
      "Traditional",
      "Extreme",
      "Hybrid"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 368,
    "text": "A project is composed of three phases that are implemented in parallel without affecting one another. The baselines for each phase have been approved, and there is minimal ability to vary the baselines during execution. Which methodology did the project manager adopt?",
    "options": [
      "Iterative approach",
      "Predictive approach",
      "Incremental approach",
      "Hybrid approach"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 369,
    "text": "During project execution, a key resource leaves the team for another job. What should the project manager do in this situation?",
    "options": [
      "Submit a change request for additional budget to secure a project resource.",
      "Distribute work to other team members to reduce impact to the project schedule.",
      "Consult with the functional manager for a replacement resource.",
      "Consult the risk register for an appropriate risk response."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 370,
    "text": "A construction project is underway and there are three months left to complete the building. A public authority responsible for approving the final stage is stalling the project. What should the project manager do?",
    "options": [
      "Visit the public authority headquarters and formally petition them for an explanation.",
      "Mitigate the risk by requesting an alternative authority to participate in the approval process.",
      "Report the issue to major stakeholders and explore corrective actions with legal assistance.",
      "Discuss this with the department head and arrive at a solution to expedite the approval."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 371,
    "text": "How can emotional intelligence (EI) be effective in project management?",
    "options": [
      "By preparing a project plan and managing team members",
      "By reducing tension and increasing cooperation among team members",
      "By planning for user‑acceptance testing",
      "By establishing project resource allocation"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 372,
    "text": "A project risks delivering late because poor quality prevents user‑acceptance testing (UAT) from finishing. The product owner will not sign off until all Severity‑1 defects are fixed. What should the project manager do?",
    "options": [
      "Review the organizational chart to find someone else who can sign off UAT.",
      "Ask developers to work longer hours to resolve the defects.",
      "Create a risk in the risk register for each S1 defect and assign actions.",
      "Consult the risk register and implement the risk‑response actions."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 373,
    "text": "Why is a project undertaken?",
    "options": [
      "To create a unique product, service, or result",
      "To achieve better management of resources",
      "To increase understanding of project management",
      "To teach program and portfolio management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 374,
    "text": "A project team is working on a driverless vehicle and is organizing a workshop with experts to analyze prototype data. Who should the project manager invite to provide expert advice?",
    "options": [
      "Major stakeholders nominated by the sponsor",
      "Usual review participants with recognized certifications",
      "Senior experts with high status in the academic community",
      "Subject‑matter experts identified in the stakeholder register"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 375,
    "text": "During a kickoff meeting, the project sponsor presents an ambitious project, but stakeholders are not excited because the work seems inefficient. What could be missing from the business case?",
    "options": [
      "Approval from the stakeholders",
      "Root‑cause analysis of the problem",
      "Work breakdown structure (WBS)",
      "Feasibility study of the solution"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 376,
    "text": "Team members lack market information to make decisions because no one understands the Asian market. They suggest recruiting members familiar with that market. What type of agile team would they be composing?",
    "options": [
      "Cross‑functional",
      "Project‑oriented",
      "Virtual",
      "Organic"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 377,
    "text": "A business manager wants to start a project to launch a new product. How should the manager initiate the project?",
    "options": [
      "Ask a small team to produce a prototype before full‑scale development.",
      "Assign a project manager and ask them to document the project scope.",
      "Prepare a detailed business case to document project objectives and success criteria.",
      "Discuss requirements with the team for alternative products in the market."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 378,
    "text": "A business analyst is working on a project that follows an adaptive life cycle. Due to budgetary constraints, the sponsor asks the team to focus on critical requirements. What should the business analyst do?",
    "options": [
      "Trace requirements.",
      "Prioritize requirements.",
      "Document requirements.",
      "Validate requirements."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 379,
    "text": "A practitioner organized a requirements workshop with the client’s frontline application users. The users explained that one of the challenges of the current application is that they must click on each input before entering data, which happens thousands of times a day. What competencies should the practitioner use to explain this need to the technicians?",
    "options": [
      "User acceptance testing",
      "System thinking",
      "Decision‑making",
      "Active listening"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 380,
    "text": "What tool can be used to track how involved and interested stakeholders are in a project?",
    "options": [
      "Stakeholder assessment matrix",
      "Stakeholder communications plan",
      "Stakeholder register",
      "Stakeholder meetings"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 381,
    "text": "A production support system is being managed by a team. The team members cannot plan their work in advance, even for a week, because they do not know when new support issues will be submitted. The team cannot start working on new issues until they finish existing issues, no matter how long it takes. Which method should be used in this situation?",
    "options": [
      "Scrum",
      "Kanban",
      "SAFe",
      "Extreme Programming (XP)"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 382,
    "text": "A project’s business analyst has to understand the newly acquired technology and the impact it will have on the organization. Which tool should be used to understand the new technology?",
    "options": [
      "Strengths, weaknesses, opportunities, threats (SWOT)",
      "Work breakdown structure (WBS)",
      "MoSCoW",
      "RACI"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 383,
    "text": "An adaptive team’s velocity dropped significantly in the last sprint due to the planned vacation of two team members. The sponsor wants to know how many more sprints it will take to complete the remaining project. How should the project manager calculate future velocity?",
    "options": [
      "Add a 30 % buffer to velocity.",
      "Change the adaptive tool used.",
      "Use the velocity of the last sprint.",
      "Average the past five sprints."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 384,
    "text": "A new business analyst has joined mid‑project and updated the requirements traceability matrix. What should the business analyst do next?",
    "options": [
      "Share it the same way as before.",
      "Consult the business analysis communications management plan.",
      "Review the project management plan.",
      "Ask the project manager to share it at the next meeting."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 385,
    "text": "A project manager is assigned to a project, but is unsure how to apply organizational resources before formal authorization. Which document should be used?",
    "options": [
      "Business case",
      "Project charter",
      "Project plan",
      "Budget requirement"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 386,
    "text": "Which of the following can a project manager conduct if they have a stakeholder who is unresponsive and/or unsupportive?",
    "options": [
      "Communication style assessment",
      "Push communications",
      "Pull communications",
      "Interactive communications"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 387,
    "text": "A project manager has agreed on the requirements and now needs to define the workflow for the end user. A critical step must be completed and validated by the end user before proceeding. Which modeling tool best describes this process?",
    "options": [
      "Use case",
      "Traceability",
      "Wireframe",
      "User interface design"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 388,
    "text": "During a virtual kick‑off session, the sponsor highlights the significance of the project to the company. What message should be conveyed to the team in this meeting?",
    "options": [
      "Promotion opportunities",
      "Assignment of key roles and responsibilities",
      "New working contract benefits",
      "Bonuses based on accomplishment criteria"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 389,
    "text": "Who should stakeholders consult to discuss concerns about the current work package?",
    "options": [
      "Project manager",
      "Project sponsor",
      "Business analyst",
      "Project coordinator"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 390,
    "text": "A team tasked with designing a product to solve an unfamiliar problem is struggling to gain traction. What should the project manager do next?",
    "options": [
      "Add the issue to the issue log.",
      "Add the risk to the risk register.",
      "Facilitate a brainstorming session.",
      "Meet with the sponsor for guidance."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 391,
    "text": "A project schedule shows 14 units of work completed against a plan of 23 units. What is the schedule variance (SV)?",
    "options": [
      "322",
      "37",
      "9",
      "‑9"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 392,
    "text": "An organization has a team of specialists dedicated to solving a complex problem. What project management approach should they consider?",
    "options": [
      "Agile",
      "Predictive",
      "Iterative",
      "Hybrid"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 393,
    "text": "When presenting a product roadmap to an adaptive team, which form of communication is most appropriate?",
    "options": [
      "Presentation slides",
      "Requirements matrix",
      "Story map",
      "Project management plan"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 394,
    "text": "What is the purpose of an adaptive stand‑up meeting?",
    "options": [
      "Ask what work is done, calculate velocity, and decide next work.",
      "Update the burndown chart, calculate velocity, and report impediments.",
      "Ask what work is done, what will be done, and report impediments.",
      "Review completed work, remove impediments, and calculate velocity."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 395,
    "text": "After the first iteration, the testing manager approves the test report. The business‑unit manager requests additional functionality before rollout approval. What should the project manager do next?",
    "options": [
      "Escalate to the PMO.",
      "Reschedule rollout to include new requirements.",
      "Escalate to the project sponsor.",
      "Reschedule rollout to start with another business unit."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 396,
    "text": "What is the main purpose of a product roadmap?",
    "options": [
      "Educate customers on upcoming changes.",
      "Provide a view of new features and their delivery sequence.",
      "Clarify the business value of each feature.",
      "Limit scope and reduce future changes."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 397,
    "text": "In the business analysis aspect of a construction project, what is the purpose of the requirements validation process?",
    "options": [
      "Ensures thorough unit‑test coverage.",
      "Ensures successful delivery of business value.",
      "Ensures that the business problem is solved.",
      "Ensures an accurate reflection of stakeholders’ intentions."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 398,
    "text": "Calculate the schedule performance index (SPI) based on the following information: earned value (EV) is 30 and planned value (PV) is 15.",
    "options": [
      "15",
      "0.5",
      "45",
      "2.0"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 399,
    "text": "Why is working in iterations usually more time-consuming than using a predictive life cycle?",
    "options": [
      "Iterations are longer than the execution phase of a traditional project.",
      "Timeboxing increases the time needed to accomplish tasks.",
      "Having a minimum viable product first can take more time.",
      "It takes time to understand what the project needs to deliver."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 400,
    "text": "During the execution of a predictive project, the need for a new product feature has been proposed by the customer. What should the project manager do next?",
    "options": [
      "Accept the customer's request and continue with elicitation of the new product features.",
      "Decline any request by the customer and continue the project as initially planned.",
      "Investigate the possibility of using the management reserve to pay for the extra hours the team will need to work.",
      "Investigate the effect that such an integration will have on the project plan and propose a change request."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 401,
    "text": "A company is moving from a predictive to an adaptive approach. How should the company now translate the already planned work breakdown structure (WBS) to adaptive iterations?",
    "options": [
      "Accept this limitation and perform accordingly since the WBS can only be used in Scrum iterations.",
      "Consider reforming the structure of the company first as it is difficult for a company to transition from predictive to adaptive methods.",
      "Save the WBS in the historical data as the information can only be used for educational purposes and not as inputs for creating user stories.",
      "Create a product backlog with the information depicted in the WBS and prioritize the newly developed user stories into iterations."
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 402,
    "text": "A project team is reviewing project performance. During the execution phase, the project team discovers that there is an off-the-shelf (OTS) product which could reduce the timeline for development. What should they do?",
    "options": [
      "Add the discovery to the assumptions.",
      "Evaluate the risk with the project team.",
      "Conduct an opportunity analysis with the team.",
      "Update the project management plan."
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 403,
    "text": "Two resources are performing a peer review of an artifact. What should be the outcome of the peer review?",
    "options": [
      "The resulting documentation adheres to established organizational standards.",
      "All business rules and data requirements for each process are documented.",
      "The data requirements for each process are documented.",
      "All relevant business rules for each process are documented."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 404,
    "text": "What is one reason why stakeholders must be identified when performing business analysis?",
    "options": [
      "To allow the business analyst to determine the project budget",
      "To identify who should define the business requirements for the project",
      "To identify project timelines through business reviews",
      "To determine a cost-benefit analysis for the project"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 405,
    "text": "Who is responsible for the business case development document?",
    "options": [
      "Project manager",
      "Project stakeholders",
      "Project team",
      "Project sponsor"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 406,
    "text": "A project manager oversees a project in an adaptive environment. After each iteration, which type of meeting should the project manager conduct?",
    "options": [
      "Retrospective",
      "Daily stand-up",
      "Backlog refinement review",
      "Iteration planning"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 407,
    "text": "In adaptive projects, who should approve the prioritization of the backlog?",
    "options": [
      "Product owner",
      "Project manager",
      "Business analyst",
      "Project sponsor"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 408,
    "text": "What should be done when the work-in-progress (WIP) limit is reached and new work has been requested?",
    "options": [
      "Decompose the work and add it to the backlog.",
      "Put the request in a holding area.",
      "Ask for the priority level of the new request.",
      "Add the work to the backlog."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 409,
    "text": "A business analyst is evaluating solutions against the expected results and logging defects along the way. The next task is to analyze the discrepancies prior to facilitating a go/no-go decision. Which technique should be used as a starting point to uncover problem areas?",
    "options": [
      "Cost-benefit analysis",
      "Feasibility analysis",
      "Opportunity analysis",
      "Elicitation"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 410,
    "text": "A business analyst is looking to uncover the root cause of a specific problem. What technique should the business analyst apply first?",
    "options": [
      "Interviews",
      "Observation",
      "Surveys",
      "Facilitated workshop"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 411,
    "text": "Which is the most accurate description of a backlog in agile?",
    "options": [
      "The backlog is the sum of all the story point sizes for the features actually completed in each project iteration.",
      "The backlog is the ordered list of all the work and helps the teams see how to deliver the highest value without creating waste.",
      "The backlog is the ordered list of all the completed work and helps the teams see how to deliver value without creating waste.",
      "The backlog is the ordered list of all the work, shows the work completed, and shows the effect of team members multitasking."
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 412,
    "text": "What is the process of determining the stakeholders impacted by a business problem or opportunity?",
    "options": [
      "Stakeholder analysis",
      "Stakeholder requirement",
      "Stakeholder characteristics",
      "Stakeholder identification"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 413,
    "text": "A project manager joined a company to replace someone that left the project. There was no hand-over, but the previous project manager developed a detailed schedule and the project team completed some project deliverables. The team is not colocated and some team members were recently hired full time. What is the most suitable project-delivery method?",
    "options": [
      "Adaptive project management",
      "Linear project management",
      "Extreme project management",
      "Integrated project management"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 414,
    "text": "An organization's annual report indicates that there needs to be a new strategy that prioritizes long-term goals and repetitive solutions. What project methodology should this organization consider?",
    "options": [
      "Iterative",
      "Hybrid",
      "Predictive",
      "Agile"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 415,
    "text": "A project team member is reviewing the scope of a task with an end user and realizes that requirements have changed. Which project artifact should be used in this situation?",
    "options": [
      "Scope management plan",
      "Risk management plan",
      "Configuration management plan",
      "Project management plan"
    ],
    "answer": 3,
    "explanation": "",
    "tags": []
  },
  {
    "id": 416,
    "text": "How should the product owner prioritize a list of tasks to be accomplished?",
    "options": [
      "Tasks that create business value should be done first.",
      "Tasks that can be completed quickly should be done first.",
      "Tasks that reduce the product backlog should be done first.",
      "Tasks that enhance the functionality of a product should be done first."
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 417,
    "text": "Vicus (team member) says they lack enough market information to make decisions; Verna (agile facilitator) confirms this is because no one on the team understands the Asian market. On which document should this situation be registered?",
    "options": [
      "Issue log",
      "Risk register",
      "Lessons learned register",
      "Change log"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 418,
    "text": "A new project manager has been assigned to an ongoing project. What will the project manager use to identify the responsibilities of the stakeholders in the project?",
    "options": [
      "Responsible, accountable, consult, and inform (RACI) chart",
      "Charter",
      "Responsibility assignment matrix (RAM)",
      "Stakeholder matrix"
    ],
    "answer": 2,
    "explanation": "",
    "tags": []
  },
  {
    "id": 419,
    "text": "A backwards‑path calculation estimates that the last work package will be completed 24 days from this coming Monday. The Scrum team operates in two‑week sprints. How many sprints are needed to complete the work?",
    "options": [
      "2",
      "1.5",
      "3",
      "2.5"
    ],
    "answer": 1,
    "explanation": "",
    "tags": []
  },
  {
    "id": 420,
    "text": "A project manager is in the planning stage and wants to show progress to the sponsor by tracking significant events in the project life cycle that signal key achievements. Which event is being planned?",
    "options": [
      "Milestones",
      "Duration",
      "Kickoff",
      "Schedule"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  },
  {
    "id": 421,
    "text": "A computer application development project is nearing closure. The project manager uses a checklist that requires formal feature‑to‑feature approval to demonstrate compliance with the customer’s specifications. Which document is the project manager using?",
    "options": [
      "Acceptance test procedure",
      "Application version process",
      "Formal installed deliverables",
      "Ceremonial acceptance plan"
    ],
    "answer": 0,
    "explanation": "",
    "tags": []
  }
]